{
    "sensor": {
        "current_interval_price": {
            "description": "Den nåværende elektrisitetsprisen per kWh",
            "long_description": "Viser nåværende pris per kWh fra ditt Tibber-abonnement",
            "usage_tips": "Bruk dette til å spore priser eller lage automatiseringer som kjører når strøm er billig"
        },
        "next_interval_price": {
            "description": "Neste intervalls elektrisitetspris per kWh",
            "long_description": "Viser prisen for det neste 15-minutters intervallet fra ditt Tibber-abonnement",
            "usage_tips": "Bruk dette til å forberede deg på kommende prisendringer eller planlegge enheter til å kjøre i billigere intervaller"
        },
        "previous_interval_price": {
            "description": "Forrige intervalls elektrisitetspris per kWh",
            "long_description": "Viser prisen for det forrige 15-minutters intervallet fra ditt Tibber-abonnement",
            "usage_tips": "Bruk dette til å gjennomgå tidligere prisendringer eller spore prishistorikk"
        },
        "current_hour_average_price": {
            "description": "Rullende 5-intervalls gjennomsnittspris per kWh",
            "long_description": "Viser gjennomsnittsprisen per kWh beregnet fra 5 intervaller: 2 foregående, nåværende og 2 neste intervaller (omtrent 75 minutter totalt). Dette gir en utjevnet 'timepris' som tilpasser seg etter hvert som tiden går, i stedet for å være fiksert til klokkeslett.",
            "usage_tips": "Bruk dette for en mer stabil prisindikator som jevner ut kortsiktige svingninger mens den fortsatt er responsiv til prisendringer. Bedre enn faste timepriser for å ta forbruksbeslutninger."
        },
        "next_hour_average_price": {
            "description": "Rullende 5-intervalls gjennomsnittspris for neste time per kWh",
            "long_description": "Viser gjennomsnittsprisen per kWh beregnet fra 5 intervaller sentrert en time frem: omtrent intervallene +2 til +6 fra nå (dekker minutter +30 til +105). Dette gir en fremtidsrettet utjevnet 'timepris' for å planlegge forbruk.",
            "usage_tips": "Bruk dette til å forutse prisendringer i neste time. Nyttig for å planlegge høyforbruksaktiviteter som lading av elbiler, kjøring av oppvaskmaskiner eller varmesystemer."
        },
        "lowest_price_today": {
            "description": "Den laveste elektrisitetsprisen i dag per kWh",
            "long_description": "Viser den laveste prisen per kWh for gjeldende dag fra ditt Tibber-abonnement",
            "usage_tips": "Bruk dette til å sammenligne nåværende priser med den billigste tiden på dagen"
        },
        "highest_price_today": {
            "description": "Den høyeste elektrisitetsprisen i dag per kWh",
            "long_description": "Viser den høyeste prisen per kWh for gjeldende dag fra ditt Tibber-abonnement",
            "usage_tips": "Bruk dette til å unngå å kjøre apparater i toppristider"
        },
        "average_price_today": {
            "description": "Den gjennomsnittlige elektrisitetsprisen i dag per kWh",
            "long_description": "Viser gjennomsnittsprisen per kWh for gjeldende dag fra ditt Tibber-abonnement",
            "usage_tips": "Bruk dette som en baseline for å sammenligne nåværende priser"
        },
        "lowest_price_tomorrow": {
            "description": "Den laveste elektrisitetsprisen i morgen per kWh",
            "long_description": "Viser den laveste prisen per kWh for morgendagen fra ditt Tibber-abonnement. Denne sensoren blir utilgjengelig inntil morgendagens data er publisert av Tibber (vanligvis rundt 13:00-14:00 CET).",
            "usage_tips": "Bruk dette til å planlegge energikrevende aktiviteter for morgendagens billigste tid. Perfekt for forhåndsplanlegging av oppvarming, elbillading eller apparater."
        },
        "highest_price_tomorrow": {
            "description": "Den høyeste elektrisitetsprisen i morgen per kWh",
            "long_description": "Viser den høyeste prisen per kWh for morgendagen fra ditt Tibber-abonnement. Denne sensoren blir utilgjengelig inntil morgendagens data er publisert av Tibber (vanligvis rundt 13:00-14:00 CET).",
            "usage_tips": "Bruk dette til å unngå å kjøre apparater i morgendagens toppristider. Nyttig for å planlegge rundt dyre perioder."
        },
        "average_price_tomorrow": {
            "description": "Den gjennomsnittlige elektrisitetsprisen i morgen per kWh",
            "long_description": "Viser gjennomsnittsprisen per kWh for morgendagen fra ditt Tibber-abonnement. Denne sensoren blir utilgjengelig inntil morgendagens data er publisert av Tibber (vanligvis rundt 13:00-14:00 CET).",
            "usage_tips": "Bruk dette som en baseline for å sammenligne morgendagens priser og planlegge forbruk. Sammenlign med dagens gjennomsnitt for å se om morgendagen vil være mer eller mindre dyr totalt sett."
        },
        "yesterday_price_level": {
            "description": "Aggregert prisnivå for i går",
            "long_description": "Viser det aggregerte prisnivået for alle intervaller i går. Bruker samme logikk som timesensorene for å bestemme det samlede prisnivået for hele dagen.",
            "usage_tips": "Bruk dette for å forstå gårsdagens generelle prissituasjon. Sammenlign med i dag for å se daglige trender."
        },
        "today_price_level": {
            "description": "Aggregert prisnivå for i dag",
            "long_description": "Viser det aggregerte prisnivået for alle intervaller i dag. Bruker samme logikk som timesensorene for å bestemme det samlede prisnivået for hele dagen.",
            "usage_tips": "Bruk dette for å forstå dagens generelle prissituasjon på et øyeblikk. Nyttig for raske vurderinger av om i dag generelt er billig eller dyrt."
        },
        "tomorrow_price_level": {
            "description": "Aggregert prisnivå for i morgen",
            "long_description": "Viser det aggregerte prisnivået for alle intervaller i morgen. Bruker samme logikk som timesensorene for å bestemme det samlede prisnivået for hele dagen. Denne sensoren blir utilgjengelig inntil morgendagens data er publisert av Tibber (vanligvis rundt 13:00-14:00 CET).",
            "usage_tips": "Bruk dette for å forstå morgendagens generelle prissituasjon. Sammenlign med i dag for å se om morgendagen vil være mer eller mindre gunstig for energiforbruk."
        },
        "yesterday_price_rating": {
            "description": "Aggregert prisvurdering for i går",
            "long_description": "Viser den aggregerte prisvurderingen (lav/normal/høy) for alle intervaller i går, basert på dine konfigurerte terskelverdier. Bruker samme logikk som timesensorene for å bestemme den samlede vurderingen for hele dagen.",
            "usage_tips": "Bruk dette for å forstå gårsdagens prissituasjon i forhold til dine personlige terskelverdier. Sammenlign med i dag for trendanalyse."
        },
        "today_price_rating": {
            "description": "Aggregert prisvurdering for i dag",
            "long_description": "Viser den aggregerte prisvurderingen (lav/normal/høy) for alle intervaller i dag, basert på dine konfigurerte terskelverdier. Bruker samme logikk som timesensorene for å bestemme den samlede vurderingen for hele dagen.",
            "usage_tips": "Bruk dette for raskt å vurdere dagens prissituasjon i forhold til dine personlige terskelverdier. Hjelper med å ta forbruksbeslutninger for gjeldende dag."
        },
        "tomorrow_price_rating": {
            "description": "Aggregert prisvurdering for i morgen",
            "long_description": "Viser den aggregerte prisvurderingen (lav/normal/høy) for alle intervaller i morgen, basert på dine konfigurerte terskelverdier. Bruker samme logikk som timesensorene for å bestemme den samlede vurderingen for hele dagen. Denne sensoren blir utilgjengelig inntil morgendagens data er publisert av Tibber (vanligvis rundt 13:00-14:00 CET).",
            "usage_tips": "Bruk dette for å planlegge morgendagens energiforbruk basert på dine personlige pristerskelverdier. Sammenlign med i dag for å bestemme om du skal flytte forbruk til i morgen eller bruke energi i dag."
        },
        "trailing_price_average": {
            "description": "Den gjennomsnittlige elektrisitetsprisen for de siste 24 timene per kWh",
            "long_description": "Viser gjennomsnittsprisen per kWh beregnet fra de siste 24 timene (glidende gjennomsnitt) fra ditt Tibber-abonnement. Dette gir et rullende gjennomsnitt som oppdateres hvert 15. minutt basert på historiske data.",
            "usage_tips": "Bruk dette til å sammenligne nåværende priser mot nylige trender. En nåværende pris betydelig over dette gjennomsnittet kan indikere et godt tidspunkt å redusere forbruket."
        },
        "leading_price_average": {
            "description": "Den gjennomsnittlige elektrisitetsprisen for de neste 24 timene per kWh",
            "long_description": "Viser gjennomsnittsprisen per kWh beregnet fra de neste 24 timene (fremtidsrettet gjennomsnitt) fra ditt Tibber-abonnement. Dette gir et fremtidsrettet gjennomsnitt basert på tilgjengelige prognosedata.",
            "usage_tips": "Bruk dette til å planlegge energibruk. Hvis nåværende pris er under det fremtidsrettede gjennomsnittet, kan det være et godt tidspunkt å kjøre energikrevende apparater."
        },
        "trailing_price_min": {
            "description": "Den minste elektrisitetsprisen for de siste 24 timene per kWh",
            "long_description": "Viser minimumsprisen per kWh fra de siste 24 timene (glidende minimum) fra ditt Tibber-abonnement. Dette gir den laveste prisen sett i de siste 24 timene.",
            "usage_tips": "Bruk dette til å se den beste prismuligheten du hadde i de siste 24 timene og sammenlign den med nåværende priser."
        },
        "trailing_price_max": {
            "description": "Den maksimale elektrisitetsprisen for de siste 24 timene per kWh",
            "long_description": "Viser maksimumsprisen per kWh fra de siste 24 timene (glidende maksimum) fra ditt Tibber-abonnement. Dette gir den høyeste prisen sett i de siste 24 timene.",
            "usage_tips": "Bruk dette til å se toppprisen i de siste 24 timene og vurdere prisvolatilitet."
        },
        "leading_price_min": {
            "description": "Den minste elektrisitetsprisen for de neste 24 timene per kWh",
            "long_description": "Viser minimumsprisen per kWh fra de neste 24 timene (fremtidsrettet minimum) fra ditt Tibber-abonnement. Dette gir den laveste prisen forventet i de neste 24 timene basert på prognosedata.",
            "usage_tips": "Bruk dette til å identifisere den beste prismuligheten som kommer og planlegge energikrevende oppgaver deretter."
        },
        "leading_price_max": {
            "description": "Den maksimale elektrisitetsprisen for de neste 24 timene per kWh",
            "long_description": "Viser maksimumsprisen per kWh fra de neste 24 timene (fremtidsrettet maksimum) fra ditt Tibber-abonnement. Dette gir den høyeste prisen forventet i de neste 24 timene basert på prognosedata.",
            "usage_tips": "Bruk dette til å unngå å kjøre apparater i kommende topprisperioder."
        },
        "current_interval_price_level": {
            "description": "Den nåværende prisnivåklassifiseringen",
            "long_description": "Viser Tibbers klassifisering av nåværende pris sammenlignet med historiske priser",
            "usage_tips": "Bruk dette til å lage automatiseringer basert på relative prisnivåer i stedet for absolutte priser"
        },
        "next_interval_price_level": {
            "description": "Prisnivå for det neste 15-minutters intervallet",
            "long_description": "Viser prisnivåklassifiseringen for det kommende intervallet. Hjelper med å forutse kortsiktige prisendringer for umiddelbar planlegging.",
            "usage_tips": "Bruk for raske beslutninger om å starte eller stoppe høyeffektenheter i de neste få minuttene."
        },
        "previous_interval_price_level": {
            "description": "Prisnivå for det forrige 15-minutters intervallet",
            "long_description": "Viser prisnivåklassifiseringen for det siste intervallet. Nyttig for historisk sammenligning og forståelse av nylige pristrender.",
            "usage_tips": "Bruk for å sammenligne nåværende vs nylige prisnivåer eller analysere forbruksmønstre mot historiske priser."
        },
        "current_hour_price_level": {
            "description": "Aggregert prisnivå for nåværende rullerende time (5 intervaller)",
            "long_description": "Viser median prisnivå på tvers av 5 intervaller (2 før, nåværende, 2 etter) som dekker omtrent 75 minutter. Gir en mer stabil prisnivåindikator som jevner ut kortsiktige svingninger.",
            "usage_tips": "Bruk for mellomlangsiktige planleggingsbeslutninger der du ønsker å unngå å reagere på korte pristopper eller fall."
        },
        "next_hour_price_level": {
            "description": "Aggregert prisnivå for neste rullerende time (5 intervaller frem)",
            "long_description": "Viser median prisnivå på tvers av 5 intervaller sentrert en time frem. Hjelper med å planlegge forbruk basert på kommende pristrender i stedet for øyeblikkelige fremtidige priser.",
            "usage_tips": "Bruk for å planlegge aktiviteter for neste time basert på en utjevnet prisnivåprognose."
        },
        "current_interval_price_rating": {
            "description": "Hvordan nåværende intervalls pris sammenlignes med historiske data",
            "long_description": "Viser hvordan nåværende intervalls pris sammenlignes med historiske prisdata som en prosentandel",
            "usage_tips": "En positiv prosentandel betyr at nåværende pris er over gjennomsnittet, negativ betyr under gjennomsnittet"
        },
        "next_interval_price_rating": {
            "description": "Prisvurdering for det neste 15-minutters intervallet",
            "long_description": "Viser hvordan neste intervalls pris sammenlignes med det rullerende 24-timers gjennomsnittet. Hjelper med å forutse om kommende priser er over eller under den nylige trenden.",
            "usage_tips": "Bruk for å ta raske beslutninger om å starte aktiviteter i neste intervall basert på relativ prisposisjon."
        },
        "previous_interval_price_rating": {
            "description": "Prisvurdering for det forrige 15-minutters intervallet",
            "long_description": "Viser hvordan siste intervalls pris sammenlignes med det rullerende gjennomsnittet. Nyttig for å forstå nylig prisatferd.",
            "usage_tips": "Bruk for å analysere hvordan prisvurderinger endret seg over tid eller validere tidligere forbruksbeslutninger."
        },
        "current_hour_price_rating": {
            "description": "Aggregert prisvurdering for nåværende rullerende time (5 intervaller)",
            "long_description": "Viser gjennomsnittlig vurdering på tvers av 5 intervaller (2 før, nåværende, 2 etter). Basert på gjennomsnittlig prosentvis forskjell fra rullerende 24t gjennomsnitt, som gir en utjevnet vurderingsindikator.",
            "usage_tips": "Bruk for stabil mellomlangsiktig prisvurdering som ikke overreagerer på kortvarige prisavvik."
        },
        "next_hour_price_rating": {
            "description": "Aggregert prisvurdering for neste rullerende time (5 intervaller frem)",
            "long_description": "Viser gjennomsnittlig vurdering for 5 intervaller sentrert en time frem. Hjelper med å forstå om neste time generelt vil være over eller under gjennomsnittlig prising.",
            "usage_tips": "Bruk for å avgjøre om du bør vente en time før du starter høyforbruksaktiviteter."
        },
        "next_avg_1h": {
            "description": "Gjennomsnittspris for neste 1 time (kun fremover fra neste intervall)",
            "long_description": "Fremtidsrettet gjennomsnitt: Viser gjennomsnitt av neste 4 intervaller (1 time) fra og med NESTE 15-minutters intervall (ikke inkludert nåværende). Forskjellig fra current_hour_average_price som inkluderer tidligere intervaller. Bruk for planlegging med absolutt pristerskel.",
            "usage_tips": "Absolutt pristerskel: Start kun apparater når gjennomsnittet forblir under din maksimalt akseptable pris (f.eks. under 0,25 EUR/kWh). Kombiner med trendsensor for optimal timing. Merk: Dette er IKKE en erstatning for timepriser - bruk current_hour_average_price for det."
        },
        "next_avg_2h": {
            "description": "Gjennomsnittspris for neste 2 timer",
            "long_description": "Viser gjennomsnittsprisen for de neste 8 intervallene (2 timer) fra og med neste 15-minutters intervall.",
            "usage_tips": "Absolutt pristerskel: Sett en maksimalt akseptabel gjennomsnittspris for standard apparater som vaskemaskiner. Sikrer at du aldri betaler mer enn din grense."
        },
        "next_avg_3h": {
            "description": "Gjennomsnittspris for neste 3 timer",
            "long_description": "Viser gjennomsnittsprisen for de neste 12 intervallene (3 timer) fra og med neste 15-minutters intervall.",
            "usage_tips": "Absolutt pristerskel: For EU Eco-programmer (oppvaskmaskiner, 3-4t kjøretid). Start kun når 3t gjennomsnitt er under din prisgrense. Bruk med trendsensor for å finne beste øyeblikk innenfor akseptabelt prisområde."
        },
        "next_avg_4h": {
            "description": "Gjennomsnittspris for neste 4 timer",
            "long_description": "Viser gjennomsnittsprisen for de neste 16 intervallene (4 timer) fra og med neste 15-minutters intervall.",
            "usage_tips": "Absolutt pristerskel: Sett maksimalt akseptabel pris for varmepumper eller varmtvannsberedere. Forhindrer drift i dyre perioder uavhengig av relative trender."
        },
        "next_avg_5h": {
            "description": "Gjennomsnittspris for neste 5 timer",
            "long_description": "Viser gjennomsnittsprisen for de neste 20 intervallene (5 timer) fra og med neste 15-minutters intervall.",
            "usage_tips": "Absolutt pristerskel: Bro mellom kort- og langsiktig planlegging. Bruk for utvidede sykluser med harde prisgrenser (f.eks. bassengpumper, utvidede oppvarmingssykluser)."
        },
        "next_avg_6h": {
            "description": "Gjennomsnittspris for neste 6 timer",
            "long_description": "Viser gjennomsnittsprisen for de neste 24 intervallene (6 timer) fra og med neste 15-minutters intervall.",
            "usage_tips": "Absolutt pristerskel: Kveldsplanlegging med pristak. Planlegg kun oppgaver hvis 6t gjennomsnitt forblir under din maksimalt akseptable kostnad."
        },
        "next_avg_8h": {
            "description": "Gjennomsnittspris for neste 8 timer",
            "long_description": "Viser gjennomsnittsprisen for de neste 32 intervallene (8 timer) fra og med neste 15-minutters intervall.",
            "usage_tips": "Absolutt pristerskel: Nattdriftsbeslutninger. Sett harde prisgrenser for nattbelastninger (batterilading, termolagring). Overskrid aldri budsjettet ditt."
        },
        "next_avg_12h": {
            "description": "Gjennomsnittspris for neste 12 timer",
            "long_description": "Viser gjennomsnittsprisen for de neste 48 intervallene (12 timer) fra og med neste 15-minutters intervall.",
            "usage_tips": "Absolutt pristerskel: Strategiske beslutninger med pristak. Fortsett kun hvis 12t gjennomsnitt er under din maksimalt akseptable pris. Bra for utsettbare store belastninger."
        },
        "price_trend_1h": {
            "description": "Pristrend for neste time",
            "long_description": "Sammenligner nåværende intervallpris med gjennomsnitt av neste 1 time (4 intervaller). Stigende hvis fremtiden er >5% høyere, fallende hvis >5% lavere, ellers stabil.",
            "usage_tips": "Relativ optimalisering: 'fallende' = vent, prisene faller. 'stigende' = handle nå eller du betaler mer. 'stabil' = prisen spiller ikke så stor rolle nå. Fungerer uavhengig av absolutt prisnivå."
        },
        "price_trend_2h": {
            "description": "Pristrend for neste 2 timer",
            "long_description": "Sammenligner nåværende intervallpris med gjennomsnitt av neste 2 timer (8 intervaller). Stigende hvis fremtiden er >5% høyere, fallende hvis >5% lavere, ellers stabil.",
            "usage_tips": "Relativ optimalisering: Ideelt for apparater. 'fallende' betyr bedre priser kommer om 2t - utsett hvis mulig. Finner beste timing innenfor ditt tilgjengelige vindu, uavhengig av sesong."
        },
        "price_trend_3h": {
            "description": "Pristrend for neste 3 timer",
            "long_description": "Sammenligner nåværende intervallpris med gjennomsnitt av neste 3 timer (12 intervaller). Stigende hvis fremtiden er >5% høyere, fallende hvis >5% lavere, ellers stabil.",
            "usage_tips": "Relativ optimalisering: For Eco-programmer. 'fallende' betyr priser faller >5% - verdt å vente. Fungerer i enhver sesong. Kombiner med avg-sensor for pristak: kun når avg < din grense OG trend ikke 'fallende'."
        },
        "price_trend_4h": {
            "description": "Pristrend for neste 4 timer",
            "long_description": "Sammenligner nåværende intervallpris med gjennomsnitt av neste 4 timer (16 intervaller). Stigende hvis fremtiden er >5% høyere, fallende hvis >5% lavere, ellers stabil.",
            "usage_tips": "Relativ optimalisering: Varmepumpe/batteribeslutninger. 'fallende' betyr bedre ladevindu kommer. Finner alltid relativ beste tid - enten prisene er 10 cent eller 50 cent. Bruk avg-sensor for absolutt grense."
        },
        "price_trend_5h": {
            "description": "Pristrend for neste 5 timer",
            "long_description": "Sammenligner nåværende intervallpris med gjennomsnitt av neste 5 timer (20 intervaller). Stigende hvis fremtiden er >5% høyere, fallende hvis >5% lavere, ellers stabil.",
            "usage_tips": "Relativ optimalisering: Utvidede operasjoner. Tilpasser seg markedet - finner beste relative timing i ethvert prismiljø. 'stabil/stigende' = godt tidspunkt å starte innenfor ditt planleggingsvindu."
        },
        "price_trend_6h": {
            "description": "Pristrend for neste 6 timer",
            "long_description": "Sammenligner nåværende intervallpris med gjennomsnitt av neste 6 timer (24 intervaller). Stigende hvis fremtiden er >5% høyere, fallende hvis >5% lavere, ellers stabil.",
            "usage_tips": "Relativ optimalisering: Kveldsbeslutninger. 'fallende' = prisene forbedres betydelig hvis du venter. Ingen faste terskler nødvendig - justerer automatisk til vinter/sommer prisnivåer."
        },
        "price_trend_8h": {
            "description": "Pristrend for neste 8 timer",
            "long_description": "Sammenligner nåværende intervallpris med gjennomsnitt av neste 8 timer (32 intervaller). Stigende hvis fremtiden er >5% høyere, fallende hvis >5% lavere, ellers stabil.",
            "usage_tips": "Relativ optimalisering: Nattplanlegging. 'fallende' betyr at å vente til natten lønner seg (>5% billigere). Fungerer hele året uten manuelle terskeljusteringer. Start når 'stabil' eller 'stigende'."
        },
        "price_trend_12h": {
            "description": "Pristrend for neste 12 timer",
            "long_description": "Sammenligner nåværende intervallpris med gjennomsnitt av neste 12 timer (48 intervaller). Stigende hvis fremtiden er >5% høyere, fallende hvis >5% lavere, ellers stabil.",
            "usage_tips": "Relativ optimalisering: Langsiktige strategiske beslutninger. 'fallende' = betydelig bedre priser kommer i natt/i morgen. Finner optimal timing i enhver markedstilstand. Best kombinert med avg-sensor pristak."
        },
        "daily_rating": {
            "description": "Hvordan dagens priser sammenlignes med historiske data",
            "long_description": "Viser hvordan dagens priser sammenlignes med historiske prisdata som en prosentandel",
            "usage_tips": "En positiv prosentandel betyr at dagens priser er over gjennomsnittet, negativ betyr under gjennomsnittet"
        },
        "monthly_rating": {
            "description": "Hvordan denne månedens priser sammenlignes med historiske data",
            "long_description": "Viser hvordan denne månedens priser sammenlignes med historiske prisdata som en prosentandel",
            "usage_tips": "En positiv prosentandel betyr at denne månedens priser er over gjennomsnittet, negativ betyr under gjennomsnittet"
        },
        "data_timestamp": {
            "description": "Tidsstempel for siste tilgjengelige prisdataintervall",
            "long_description": "Viser tidsstempelet for siste tilgjengelige prisdataintervall fra ditt Tibber-abonnement"
        },
        "today_volatility": {
            "description": "Prisvolatilitetsklassifisering for i dag",
            "long_description": "Viser hvor mye strømprisene varierer gjennom dagen basert på spredningen (forskjellen mellom høyeste og laveste pris). Klassifisering: LOW = spredning < 5øre, MODERATE = 5-15øre, HIGH = 15-30øre, VERY HIGH = >30øre.",
            "usage_tips": "Bruk dette til å bestemme om prisbasert optimalisering er verdt det. For eksempel, med et balkongbatteri som har 15% effektivitetstap, er optimalisering kun meningsfull når volatiliteten er minst MODERATE. Opprett automatiseringer som sjekker volatilitet før planlegging av lade-/utladingssykluser."
        },
        "tomorrow_volatility": {
            "description": "Prisvolatilitetsklassifisering for i morgen",
            "long_description": "Viser hvor mye strømprisene vil variere gjennom morgendagen basert på spredningen (forskjellen mellom høyeste og laveste pris). Blir utilgjengelig til morgendagens data er publisert (typisk 13:00-14:00 CET).",
            "usage_tips": "Bruk dette til forhåndsplanlegging av morgendagens energiforbruk. Hvis morgendagen har HIGH eller VERY HIGH volatilitet, er det verdt å optimalisere tidspunktet for energiforbruk. Hvis LOW, kan du kjøre enheter når som helst uten betydelige kostnadsforskjeller."
        },
        "next_24h_volatility": {
            "description": "Prisvolatilitetsklassifisering for de rullerende neste 24 timene",
            "long_description": "Viser hvor mye strømprisene varierer i de neste 24 timene fra nå (rullerende vindu). Dette krysser daggrenser og oppdateres hvert 15. minutt, og gir en fremoverskuende volatilitetsvurdering uavhengig av kalenderdager.",
            "usage_tips": "Beste sensor for sanntids optimaliseringsbeslutninger. I motsetning til dagens/morgendagens sensorer som bytter ved midnatt, gir denne kontinuerlig 24t volatilitetsvurdering. Bruk til batteriladingsstrategier som spenner over daggrenser."
        },
        "today_tomorrow_volatility": {
            "description": "Kombinert prisvolatilitetsklassifisering for i dag og i morgen",
            "long_description": "Viser volatilitet på tvers av både i dag og i morgen kombinert (når morgendagens data er tilgjengelig). Gir en utvidet oversikt over prisvariasjoner som spenner over opptil 48 timer. Faller tilbake til kun i dag når morgendagens data ikke er tilgjengelig ennå.",
            "usage_tips": "Bruk dette til flerørs planlegging og for å forstå om prismuligheter eksisterer på tvers av daggrensen. Attributtene 'today_volatility' og 'tomorrow_volatility' viser individuelle dagsbidrag. Nyttig for planlegging av ladesesjoner som kan strekke seg over midnatt."
        },
        "price_forecast": {
            "description": "Prognose for kommende elektrisitetspriser",
            "long_description": "Viser kommende elektrisitetspriser for fremtidige intervaller i et format som er enkelt å bruke i dashboards",
            "usage_tips": "Bruk denne entitetens attributter til å vise kommende priser i diagrammer eller tilpassede kort. Få tilgang til enten 'intervals' for alle fremtidige intervaller eller 'hours' for timesammendrag."
        }
    },
    "binary_sensor": {
        "tomorrow_data_available": {
            "description": "Om prisdata for morgendagen er tilgjengelig",
            "long_description": "Indikerer om prisdata for neste dag er mottatt fra Tibber",
            "usage_tips": "Bruk dette til å sjekke om morgendagens priser er tilgjengelig for planlegging"
        },
        "peak_price_period": {
            "description": "Om nåværende intervall er blant de dyreste på dagen",
            "long_description": "Slår seg på når nåværende pris er i topp 20% av dagens priser",
            "usage_tips": "Bruk dette til å unngå å kjøre høyforbruksapparater i dyre intervaller"
        },
        "best_price_period": {
            "description": "Om nåværende intervall er blant de billigste på dagen",
            "long_description": "Slår seg på når nåværende pris er i bunn 20% av dagens priser",
            "usage_tips": "Bruk dette til å kjøre høyforbruksapparater i de billigste intervallene"
        },
        "connection": {
            "description": "Om tilkoblingen til Tibber API fungerer",
            "long_description": "Indikerer om integrasjonen kan koble til Tibber API",
            "usage_tips": "Bruk dette til å overvåke tilkoblingsstatusen til Tibber API"
        }
    },
    "home_types": {
        "APARTMENT": "Leilighet",
        "ROWHOUSE": "Rekkehus",
        "HOUSE": "Hus",
        "COTTAGE": "Hytte"
    }
}
