{
    "sensor": {
        "current_interval_price": {
            "description": "De huidige elektriciteitsprijs per kWh",
            "long_description": "Toont de huidige prijs per kWh van uw Tibber-abonnement",
            "usage_tips": "Gebruik dit om prijzen bij te houden of om automatiseringen te maken die worden uitgevoerd wanneer elektriciteit goedkoop is"
        },
        "next_interval_price": {
            "description": "De volgende interval elektriciteitsprijs per kWh",
            "long_description": "Toont de prijs voor het volgende 15-minuten interval van uw Tibber-abonnement",
            "usage_tips": "Gebruik dit om u voor te bereiden op aanstaande prijswijzigingen of om apparaten te plannen om tijdens goedkopere intervallen te draaien"
        },
        "previous_interval_price": {
            "description": "De vorige interval elektriciteitsprijs per kWh",
            "long_description": "Toont de prijs voor het vorige 15-minuten interval van uw Tibber-abonnement",
            "usage_tips": "Gebruik dit om eerdere prijswijzigingen te bekijken of prijsgeschiedenis bij te houden"
        },
        "current_hour_average": {
            "description": "Voortschrijdend 5-interval gemiddelde prijs per kWh",
            "long_description": "Toont de gemiddelde prijs per kWh berekend uit 5 intervallen: 2 vorige, huidige en 2 volgende intervallen (ongeveer 75 minuten totaal). Dit biedt een vloeiende 'uurprijs' die zich aanpast naarmate de tijd verstrijkt, in plaats van vast te zitten aan klokuren.",
            "usage_tips": "Gebruik dit voor een stabielere prijsindicator die korte schommelingen afvlakt terwijl deze nog steeds reageert op prijswijzigingen. Beter dan vaste uurprijzen voor verbruiksbeslissingen."
        },
        "next_hour_average": {
            "description": "Voortschrijdend 5-interval gemiddelde prijs voor volgend uur per kWh",
            "long_description": "Toont de gemiddelde prijs per kWh berekend uit 5 intervallen gecentreerd één uur vooruit: ongeveer intervallen +2 tot +6 vanaf nu (dekking van minuten +30 tot +105). Dit biedt een vooruitkijkende vloeiende 'uurprijs' voor verbruiksplanning.",
            "usage_tips": "Gebruik dit om prijswijzigingen in het volgende uur te anticiperen. Handig voor het plannen van activiteiten met hoog verbruik zoals het opladen van elektrische voertuigen, het draaien van vaatwassers of verwarmingssystemen."
        },
        "lowest_price_today": {
            "description": "De laagste elektriciteitsprijs voor vandaag per kWh",
            "long_description": "Toont de laagste prijs per kWh voor de huidige dag van uw Tibber-abonnement",
            "usage_tips": "Gebruik dit om huidige prijzen te vergelijken met de goedkoopste tijd van de dag"
        },
        "highest_price_today": {
            "description": "De hoogste elektriciteitsprijs voor vandaag per kWh",
            "long_description": "Toont de hoogste prijs per kWh voor de huidige dag van uw Tibber-abonnement",
            "usage_tips": "Gebruik dit om te voorkomen dat u apparaten draait tijdens piekprijstijden"
        },
        "average_price_today": {
            "description": "De gemiddelde elektriciteitsprijs voor vandaag per kWh",
            "long_description": "Toont de gemiddelde prijs per kWh voor de huidige dag van uw Tibber-abonnement",
            "usage_tips": "Gebruik dit als basislijn voor het vergelijken van huidige prijzen"
        },
        "lowest_price_tomorrow": {
            "description": "De laagste elektriciteitsprijs voor morgen per kWh",
            "long_description": "Toont de laagste prijs per kWh voor morgen van uw Tibber-abonnement. Deze sensor wordt niet beschikbaar totdat de gegevens van morgen door Tibber worden gepubliceerd (meestal rond 13:00-14:00 CET).",
            "usage_tips": "Gebruik dit om energie-intensieve activiteiten te plannen voor de goedkoopste tijd van morgen. Perfect voor vooraf plannen van verwarming, EV-laden of apparaten."
        },
        "highest_price_tomorrow": {
            "description": "De hoogste elektriciteitsprijs voor morgen per kWh",
            "long_description": "Toont de hoogste prijs per kWh voor morgen van uw Tibber-abonnement. Deze sensor wordt niet beschikbaar totdat de gegevens van morgen door Tibber worden gepubliceerd (meestal rond 13:00-14:00 CET).",
            "usage_tips": "Gebruik dit om te voorkomen dat u apparaten draait tijdens de piekprijstijden van morgen. Handig voor het plannen rond dure perioden."
        },
        "average_price_tomorrow": {
            "description": "De gemiddelde elektriciteitsprijs voor morgen per kWh",
            "long_description": "Toont de gemiddelde prijs per kWh voor morgen van uw Tibber-abonnement. Deze sensor wordt niet beschikbaar totdat de gegevens van morgen door Tibber worden gepubliceerd (meestal rond 13:00-14:00 CET).",
            "usage_tips": "Gebruik dit als basislijn voor het vergelijken van prijzen van morgen en het plannen van verbruik. Vergelijk met het gemiddelde van vandaag om te zien of morgen over het algemeen duurder of goedkoper wordt."
        },
        "yesterday_price_level": {
            "description": "Geaggregeerd prijsniveau voor gisteren",
            "long_description": "Toont het geaggregeerde prijsniveau voor alle intervallen van gisteren. Gebruikt dezelfde logica als de uursensoren om het totale prijsniveau voor de hele dag te bepalen.",
            "usage_tips": "Gebruik dit om de algemene prijssituatie van gisteren te begrijpen. Vergelijk met vandaag om dagelijkse trends te zien."
        },
        "today_price_level": {
            "description": "Geaggregeerd prijsniveau voor vandaag",
            "long_description": "Toont het geaggregeerde prijsniveau voor alle intervallen van vandaag. Gebruikt dezelfde logica als de uursensoren om het totale prijsniveau voor de hele dag te bepalen.",
            "usage_tips": "Gebruik dit om de prijssituatie van vandaag in één oogopslag te begrijpen. Handig voor snelle beoordelingen of vandaag over het algemeen goedkoop of duur is."
        },
        "tomorrow_price_level": {
            "description": "Geaggregeerd prijsniveau voor morgen",
            "long_description": "Toont het geaggregeerde prijsniveau voor alle intervallen van morgen. Gebruikt dezelfde logica als de uursensoren om het totale prijsniveau voor de hele dag te bepalen. Deze sensor wordt niet beschikbaar totdat de gegevens van morgen door Tibber worden gepubliceerd (meestal rond 13:00-14:00 CET).",
            "usage_tips": "Gebruik dit om de prijssituatie van morgen te begrijpen. Vergelijk met vandaag om te zien of morgen gunstiger of ongunstiger zal zijn voor energieverbruik."
        },
        "yesterday_price_rating": {
            "description": "Geaggregeerde prijsbeoordeling voor gisteren",
            "long_description": "Toont de geaggregeerde prijsbeoordeling (laag/normaal/hoog) voor alle intervallen van gisteren, gebaseerd op uw geconfigureerde drempelwaarden. Gebruikt dezelfde logica als de uursensoren om de totale beoordeling voor de hele dag te bepalen.",
            "usage_tips": "Gebruik dit om de prijssituatie van gisteren te begrijpen ten opzichte van uw persoonlijke drempelwaarden. Vergelijk met vandaag voor trendanalyse."
        },
        "today_price_rating": {
            "description": "Geaggregeerde prijsbeoordeling voor vandaag",
            "long_description": "Toont de geaggregeerde prijsbeoordeling (laag/normaal/hoog) voor alle intervallen van vandaag, gebaseerd op uw geconfigureerde drempelwaarden. Gebruikt dezelfde logica als de uursensoren om de totale beoordeling voor de hele dag te bepalen.",
            "usage_tips": "Gebruik dit om snel de prijssituatie van vandaag te beoordelen ten opzichte van uw persoonlijke drempelwaarden. Helpt bij het nemen van verbruiksbeslissingen voor de huidige dag."
        },
        "tomorrow_price_rating": {
            "description": "Geaggregeerde prijsbeoordeling voor morgen",
            "long_description": "Toont de geaggregeerde prijsbeoordeling (laag/normaal/hoog) voor alle intervallen van morgen, gebaseerd op uw geconfigureerde drempelwaarden. Gebruikt dezelfde logica als de uursensoren om de totale beoordeling voor de hele dag te bepalen. Deze sensor wordt niet beschikbaar totdat de gegevens van morgen door Tibber worden gepubliceerd (meestal rond 13:00-14:00 CET).",
            "usage_tips": "Gebruik dit om het energieverbruik van morgen te plannen op basis van uw persoonlijke prijsdrempelwaarden. Vergelijk met vandaag om te beslissen of u verbruik naar morgen moet verschuiven of vandaag energie moet gebruiken."
        },
        "trailing_price_average": {
            "description": "De gemiddelde elektriciteitsprijs voor de afgelopen 24 uur per kWh",
            "long_description": "Toont de gemiddelde prijs per kWh berekend uit de afgelopen 24 uur (voortschrijdend gemiddelde) van uw Tibber-abonnement. Dit biedt een voortschrijdend gemiddelde dat elke 15 minuten wordt bijgewerkt op basis van historische gegevens.",
            "usage_tips": "Gebruik dit om huidige prijzen te vergelijken met recente trends. Een huidige prijs die aanzienlijk boven dit gemiddelde ligt, kan aangeven dat het een goed moment is om het verbruik te verminderen."
        },
        "leading_price_average": {
            "description": "De gemiddelde elektriciteitsprijs voor de komende 24 uur per kWh",
            "long_description": "Toont de gemiddelde prijs per kWh berekend uit de komende 24 uur (vooruitlopend gemiddelde) van uw Tibber-abonnement. Dit biedt een vooruitkijkend gemiddelde op basis van beschikbare prognosegegevens.",
            "usage_tips": "Gebruik dit om energieverbruik te plannen. Als de huidige prijs onder het vooruitlopende gemiddelde ligt, kan het een goed moment zijn om energie-intensieve apparaten te laten draaien."
        },
        "trailing_price_min": {
            "description": "De minimale elektriciteitsprijs voor de afgelopen 24 uur per kWh",
            "long_description": "Toont de minimumprijs per kWh van de afgelopen 24 uur (voortschrijdend minimum) van uw Tibber-abonnement. Dit geeft de laagste prijs die in de afgelopen 24 uur is gezien.",
            "usage_tips": "Gebruik dit om de beste prijsmogelijkheid te zien die u in de afgelopen 24 uur had en vergelijk deze met huidige prijzen."
        },
        "trailing_price_max": {
            "description": "De maximale elektriciteitsprijs voor de afgelopen 24 uur per kWh",
            "long_description": "Toont de maximumprijs per kWh van de afgelopen 24 uur (voortschrijdend maximum) van uw Tibber-abonnement. Dit geeft de hoogste prijs die in de afgelopen 24 uur is gezien.",
            "usage_tips": "Gebruik dit om de piekprijs in de afgelopen 24 uur te zien en prijsvolatiliteit te beoordelen."
        },
        "leading_price_min": {
            "description": "De minimale elektriciteitsprijs voor de komende 24 uur per kWh",
            "long_description": "Toont de minimumprijs per kWh van de komende 24 uur (vooruitlopend minimum) van uw Tibber-abonnement. Dit geeft de laagste prijs die wordt verwacht in de komende 24 uur op basis van prognosegegevens.",
            "usage_tips": "Gebruik dit om de beste prijsmogelijkheid te identificeren die eraan komt en plan energie-intensieve taken dienovereenkomstig."
        },
        "leading_price_max": {
            "description": "De maximale elektriciteitsprijs voor de komende 24 uur per kWh",
            "long_description": "Toont de maximumprijs per kWh van de komende 24 uur (vooruitlopend maximum) van uw Tibber-abonnement. Dit geeft de hoogste prijs die wordt verwacht in de komende 24 uur op basis van prognosegegevens.",
            "usage_tips": "Gebruik dit om te voorkomen dat u apparaten draait tijdens aanstaande piekprijsperioden."
        },
        "current_interval_price_level": {
            "description": "De huidige prijsniveauclassificatie",
            "long_description": "Toont de classificatie van Tibber van de huidige prijs vergeleken met historische prijzen",
            "usage_tips": "Gebruik dit om automatiseringen te maken op basis van relatieve prijsniveaus in plaats van absolute prijzen"
        },
        "next_interval_price_level": {
            "description": "Prijsniveau voor het volgende 15-minuten interval",
            "long_description": "Toont de prijsniveauclassificatie voor het komende interval. Helpt korte-termijn prijswijzigingen te anticiperen voor directe planning.",
            "usage_tips": "Gebruik voor snelle beslissingen over het starten of stoppen van apparaten met hoog vermogen in de komende minuten."
        },
        "previous_interval_price_level": {
            "description": "Prijsniveau voor het vorige 15-minuten interval",
            "long_description": "Toont de prijsniveauclassificatie voor het laatste interval. Nuttig voor historische vergelijking en begrip van recente prijstrends.",
            "usage_tips": "Gebruik om huidige vs recente prijsniveaus te vergelijken of verbruikspatronen te analyseren tegen historische prijzen."
        },
        "current_hour_price_level": {
            "description": "Geaggregeerd prijsniveau voor huidig voortschrijdend uur (5 intervallen)",
            "long_description": "Toont het mediane prijsniveau over 5 intervallen (2 ervoor, huidig, 2 erna) dat ongeveer 75 minuten beslaat. Biedt een stabielere prijsniveauindicator die kortetermijnschommelingen afvlakt.",
            "usage_tips": "Gebruik voor planningsbeslissingen op middellange termijn waarbij u niet wilt reageren op korte prijspieken of -dalingen."
        },
        "next_hour_price_level": {
            "description": "Geaggregeerd prijsniveau voor volgend voortschrijdend uur (5 intervallen vooruit)",
            "long_description": "Toont het mediane prijsniveau over 5 intervallen gecentreerd één uur vooruit. Helpt verbruik te plannen op basis van aanstaande prijstrends in plaats van momentane toekomstige prijzen.",
            "usage_tips": "Gebruik om activiteiten voor het volgende uur te plannen op basis van een vloeiende prijsniveauprognose."
        },
        "current_interval_price_rating": {
            "description": "Hoe de prijs van het huidige interval zich verhoudt tot historische gegevens",
            "long_description": "Toont hoe de prijs van het huidige interval zich verhoudt tot historische prijsgegevens als een percentage",
            "usage_tips": "Een positief percentage betekent dat de huidige prijs boven het gemiddelde ligt, negatief betekent onder het gemiddelde"
        },
        "next_interval_price_rating": {
            "description": "Prijsbeoordeling voor het volgende 15-minuten interval",
            "long_description": "Toont hoe de prijs van het volgende interval zich verhoudt tot het voortschrijdende 24-uurs gemiddelde. Helpt te anticiperen of aanstaande prijzen boven of onder de recente trend liggen.",
            "usage_tips": "Gebruik om snelle beslissingen te nemen over het starten van activiteiten in het volgende interval op basis van relatieve prijspositie."
        },
        "previous_interval_price_rating": {
            "description": "Prijsbeoordeling voor het vorige 15-minuten interval",
            "long_description": "Toont hoe de prijs van het laatste interval zich verhield tot het voortschrijdende gemiddelde. Nuttig voor het begrijpen van recent prijsgedrag.",
            "usage_tips": "Gebruik voor het analyseren van hoe prijsbeoordelingen in de loop van de tijd veranderden of het valideren van eerdere verbruiksbeslissingen."
        },
        "current_hour_price_rating": {
            "description": "Geaggregeerde prijsbeoordeling voor huidig voortschrijdend uur (5 intervallen)",
            "long_description": "Toont de gemiddelde beoordeling over 5 intervallen (2 ervoor, huidig, 2 erna). Gebaseerd op het gemiddelde procentuele verschil van het voortschrijdende 24u gemiddelde, wat een vloeiende beoordelingsindicator oplevert.",
            "usage_tips": "Gebruik voor stabiele prijsbeoordeling op middellange termijn die niet overreageert op korte prijsafwijkingen."
        },
        "next_hour_price_rating": {
            "description": "Geaggregeerde prijsbeoordeling voor volgend voortschrijdend uur (5 intervallen vooruit)",
            "long_description": "Toont de gemiddelde beoordeling voor 5 intervallen gecentreerd één uur vooruit. Helpt te begrijpen of het volgende uur over het algemeen boven of onder gemiddelde prijzen zal liggen.",
            "usage_tips": "Gebruik om te beslissen of u een uur moet wachten voordat u activiteiten met hoog verbruik start."
        },
        "next_avg_1h": {
            "description": "Gemiddelde prijs voor het volgende 1 uur (alleen vooruit vanaf volgend interval)",
            "long_description": "Vooruitkijkend gemiddelde: Toont gemiddelde van volgende 4 intervallen (1 uur) vanaf het VOLGENDE 15-minuten interval (niet inclusief huidig). Verschilt van current_hour_average die vorige intervallen omvat. Gebruik voor absolute prijsdrempelplanning.",
            "usage_tips": "Absolute prijsdrempel: Start apparaten alleen wanneer het gemiddelde onder uw maximaal acceptabele prijs blijft (bijv. onder 0,25 EUR/kWh). Combineer met trendsensor voor optimale timing. Let op: Dit is GEEN vervanging voor uurprijzen - gebruik current_hour_average daarvoor."
        },
        "next_avg_2h": {
            "description": "Gemiddelde prijs voor de volgende 2 uur",
            "long_description": "Toont de gemiddelde prijs voor de volgende 8 intervallen (2 uur) vanaf het volgende 15-minuten interval.",
            "usage_tips": "Absolute prijsdrempel: Stel een maximaal acceptabele gemiddelde prijs in voor standaard apparaten zoals wasmachines. Zorgt ervoor dat u nooit meer betaalt dan uw limiet."
        },
        "next_avg_3h": {
            "description": "Gemiddelde prijs voor de volgende 3 uur",
            "long_description": "Toont de gemiddelde prijs voor de volgende 12 intervallen (3 uur) vanaf het volgende 15-minuten interval.",
            "usage_tips": "Absolute prijsdrempel: Voor EU Eco-programma's (vaatwassers, 3-4u looptijd). Start alleen wanneer 3u gemiddelde onder uw prijslimiet is. Gebruik met trendsensor om beste moment binnen acceptabel prijsbereik te vinden."
        },
        "next_avg_4h": {
            "description": "Gemiddelde prijs voor de volgende 4 uur",
            "long_description": "Toont de gemiddelde prijs voor de volgende 16 intervallen (4 uur) vanaf het volgende 15-minuten interval.",
            "usage_tips": "Absolute prijsdrempel: Stel maximaal acceptabele prijs in voor warmtepompen of boilers. Voorkomt werking tijdens dure perioden ongeacht relatieve trends."
        },
        "next_avg_5h": {
            "description": "Gemiddelde prijs voor de volgende 5 uur",
            "long_description": "Toont de gemiddelde prijs voor de volgende 20 intervallen (5 uur) vanaf het volgende 15-minuten interval.",
            "usage_tips": "Absolute prijsdrempel: Brug tussen korte en lange termijn planning. Gebruik voor uitgebreide cycli met harde prijslimieten (bijv. zwembadpompen, uitgebreide verwarmingscycli)."
        },
        "next_avg_6h": {
            "description": "Gemiddelde prijs voor de volgende 6 uur",
            "long_description": "Toont de gemiddelde prijs voor de volgende 24 intervallen (6 uur) vanaf het volgende 15-minuten interval.",
            "usage_tips": "Absolute prijsdrempel: Avondplanning met prijslimieten. Plan taken alleen als 6u gemiddelde onder uw maximaal acceptabele kosten blijft."
        },
        "next_avg_8h": {
            "description": "Gemiddelde prijs voor de volgende 8 uur",
            "long_description": "Toont de gemiddelde prijs voor de volgende 32 intervallen (8 uur) vanaf het volgende 15-minuten interval.",
            "usage_tips": "Absolute prijsdrempel: Nachtelijke bedieningsbeslissingen. Stel harde prijslimieten in voor nachtelijke belastingen (batterij opladen, thermische opslag). Overschrijd nooit uw budget."
        },
        "next_avg_12h": {
            "description": "Gemiddelde prijs voor de volgende 12 uur",
            "long_description": "Toont de gemiddelde prijs voor de volgende 48 intervallen (12 uur) vanaf het volgende 15-minuten interval.",
            "usage_tips": "Absolute prijsdrempel: Strategische beslissingen met prijslimieten. Ga alleen door als 12u gemiddelde onder uw maximaal acceptabele prijs is. Goed voor uitgestelde grote belastingen."
        },
        "price_trend_1h": {
            "description": "Prijstrend voor het volgende uur",
            "long_description": "Vergelijkt huidige intervalprijs met gemiddelde van volgend 1 uur (4 intervallen). Stijgend als toekomst >5% hoger is, dalend als >5% lager, anders stabiel.",
            "usage_tips": "Relatieve optimalisatie: 'dalend' = wacht, prijzen dalen. 'stijgend' = handel nu of u betaalt meer. 'stabiel' = prijs maakt nu niet veel uit. Werkt onafhankelijk van absoluut prijsniveau."
        },
        "price_trend_2h": {
            "description": "Prijstrend voor de volgende 2 uur",
            "long_description": "Vergelijkt huidige intervalprijs met gemiddelde van volgende 2 uur (8 intervallen). Stijgend als toekomst >5% hoger is, dalend als >5% lager, anders stabiel.",
            "usage_tips": "Relatieve optimalisatie: Ideaal voor apparaten. 'dalend' betekent betere prijzen komen over 2u - stel uit indien mogelijk. Vindt beste timing binnen uw beschikbare venster, ongeacht seizoen."
        },
        "price_trend_3h": {
            "description": "Prijstrend voor de volgende 3 uur",
            "long_description": "Vergelijkt huidige intervalprijs met gemiddelde van volgende 3 uur (12 intervallen). Stijgend als toekomst >5% hoger is, dalend als >5% lager, anders stabiel.",
            "usage_tips": "Relatieve optimalisatie: Voor Eco-programma's. 'dalend' betekent prijzen dalen >5% - het wachten waard. Werkt in elk seizoen. Combineer met avg-sensor voor prijslimiet: alleen wanneer avg < uw limiet EN trend niet 'dalend'."
        },
        "price_trend_4h": {
            "description": "Prijstrend voor de volgende 4 uur",
            "long_description": "Vergelijkt huidige intervalprijs met gemiddelde van volgende 4 uur (16 intervallen). Stijgend als toekomst >5% hoger is, dalend als >5% lager, anders stabiel.",
            "usage_tips": "Relatieve optimalisatie: Warmtepomp/batterij beslissingen. 'dalend' betekent beter laadvenster komt. Vindt altijd relatief beste tijd - of prijzen nu 10 cent of 50 cent zijn. Gebruik avg-sensor voor absolute limiet."
        },
        "price_trend_5h": {
            "description": "Prijstrend voor de volgende 5 uur",
            "long_description": "Vergelijkt huidige intervalprijs met gemiddelde van volgende 5 uur (20 intervallen). Stijgend als toekomst >5% hoger is, dalend als >5% lager, anders stabiel.",
            "usage_tips": "Relatieve optimalisatie: Uitgebreide operaties. Past zich aan de markt aan - vindt beste relatieve timing in elke prijsomgeving. 'stabiel/stijgend' = goed moment om te starten binnen uw planningsvenster."
        },
        "price_trend_6h": {
            "description": "Prijstrend voor de volgende 6 uur",
            "long_description": "Vergelijkt huidige intervalprijs met gemiddelde van volgende 6 uur (24 intervallen). Stijgend als toekomst >5% hoger is, dalend als >5% lager, anders stabiel.",
            "usage_tips": "Relatieve optimalisatie: Avandbeslissingen. 'dalend' = prijzen verbeteren aanzienlijk als u wacht. Geen vaste drempels nodig - past automatisch aan winter/zomer prijsniveaus."
        },
        "price_trend_8h": {
            "description": "Prijstrend voor de volgende 8 uur",
            "long_description": "Vergelijkt huidige intervalprijs met gemiddelde van volgende 8 uur (32 intervallen). Stijgend als toekomst >5% hoger is, dalend als >5% lager, anders stabiel.",
            "usage_tips": "Relatieve optimalisatie: Nachtplanning. 'dalend' betekent wachten tot de nacht loont (>5% goedkoper). Werkt het hele jaar door zonder handmatige drempelaanpassingen. Start wanneer 'stabiel' of 'stijgend'."
        },
        "price_trend_12h": {
            "description": "Prijstrend voor de volgende 12 uur",
            "long_description": "Vergelijkt huidige intervalprijs met gemiddelde van volgende 12 uur (48 intervallen). Stijgend als toekomst >5% hoger is, dalend als >5% lager, anders stabiel.",
            "usage_tips": "Relatieve optimalisatie: Lange termijn strategische beslissingen. 'dalend' = aanzienlijk betere prijzen komen vannacht/morgen. Vindt optimale timing in elke marktconditie. Best gecombineerd met avg-sensor prijslimiet."
        },
        "daily_rating": {
            "description": "Hoe de prijzen van vandaag zich verhouden tot historische gegevens",
            "long_description": "Toont hoe de prijzen van vandaag zich verhouden tot historische prijsgegevens als een percentage",
            "usage_tips": "Een positief percentage betekent dat de prijzen van vandaag boven het gemiddelde liggen, negatief betekent onder het gemiddelde"
        },
        "monthly_rating": {
            "description": "Hoe de prijzen van deze maand zich verhouden tot historische gegevens",
            "long_description": "Toont hoe de prijzen van deze maand zich verhouden tot historische prijsgegevens als een percentage",
            "usage_tips": "Een positief percentage betekent dat de prijzen van deze maand boven het gemiddelde liggen, negatief betekent onder het gemiddelde"
        },
        "data_timestamp": {
            "description": "Tijdstempel van het laatst beschikbare prijsgegevensinterval",
            "long_description": "Toont het tijdstempel van het laatst beschikbare prijsgegevensinterval van uw Tibber-abonnement"
        },
        "today_volatility": {
            "description": "Prijsvolatiliteitsclassificatie voor vandaag",
            "long_description": "Toont hoeveel elektriciteitsprijzen variëren gedurende vandaag op basis van de spreiding (verschil tussen hoogste en laagste prijs). Classificatie: LOW = spreiding < 5ct, MODERATE = 5-15ct, HIGH = 15-30ct, VERY HIGH = >30ct.",
            "usage_tips": "Gebruik dit om te bepalen of prijsgebaseerde optimalisatie de moeite waard is. Bijvoorbeeld, met een balkonbatterij met 15% efficiëntieverlies is optimalisatie alleen zinvol wanneer volatiliteit ten minste MODERATE is. Maak automatiseringen die volatiliteit controleren voordat u laad-/ontlaadcycli plant."
        },
        "tomorrow_volatility": {
            "description": "Prijsvolatiliteitsclassificatie voor morgen",
            "long_description": "Toont hoeveel elektriciteitsprijzen zullen variëren gedurende morgen op basis van de spreiding (verschil tussen hoogste en laagste prijs). Wordt onbeschikbaar totdat de gegevens van morgen zijn gepubliceerd (meestal 13:00-14:00 CET).",
            "usage_tips": "Gebruik dit voor vooruitplanning van het energieverbruik van morgen. Als morgen HIGH of VERY HIGH volatiliteit heeft, is het de moeite waard om de timing van energieverbruik te optimaliseren. Bij LOW kunt u apparaten op elk moment gebruiken zonder significante kostenverschillen."
        },
        "next_24h_volatility": {
            "description": "Prijsvolatiliteitsclassificatie voor de rollende volgende 24 uur",
            "long_description": "Toont hoeveel elektriciteitsprijzen variëren in de volgende 24 uur vanaf nu (rollend venster). Dit overschrijdt daggrenzen en wordt elke 15 minuten bijgewerkt, wat een vooruitkijkende volatiliteitsbeoordeling biedt onafhankelijk van kalenderdagen.",
            "usage_tips": "Beste sensor voor realtime optimalisatiebeslissingen. In tegenstelling tot vandaag/morgen-sensoren die om middernacht wisselen, biedt deze een continue 24-uurs volatiliteitsbeoordeling. Gebruik voor batterijlaadstrategieën die over daggrenzen heen gaan."
        },
        "today_tomorrow_volatility": {
            "description": "Gecombineerde prijsvolatiliteitsclassificatie voor vandaag en morgen",
            "long_description": "Toont volatiliteit over zowel vandaag als morgen gecombineerd (wanneer de gegevens van morgen beschikbaar zijn). Biedt een uitgebreid beeld van prijsvariatie over maximaal 48 uur. Valt terug op alleen vandaag wanneer de gegevens van morgen nog niet beschikbaar zijn.",
            "usage_tips": "Gebruik dit voor meerdaagse planning en om te begrijpen of prijskansen bestaan over de daggrens heen. De 'today_volatility' en 'tomorrow_volatility' breakdown-attributen tonen individuele dagbijdragen. Nuttig voor het plannen van laadsessies die middernacht kunnen overschrijden."
        },
        "price_forecast": {
            "description": "Prognose van aanstaande elektriciteitsprijzen",
            "long_description": "Toont aanstaande elektriciteitsprijzen voor toekomstige intervallen in een formaat dat gemakkelijk te gebruiken is in dashboards",
            "usage_tips": "Gebruik de attributen van deze entiteit om aanstaande prijzen weer te geven in grafieken of aangepaste kaarten. Toegang tot 'intervals' voor alle toekomstige intervallen of 'hours' voor uuroverzichten."
        }
    },
    "binary_sensor": {
        "tomorrow_data_available": {
            "description": "Of prijsgegevens voor morgen beschikbaar zijn",
            "long_description": "Geeft aan of prijsgegevens voor de volgende dag zijn ontvangen van Tibber",
            "usage_tips": "Gebruik dit om te controleren of de prijzen van morgen beschikbaar zijn voor planning"
        },
        "peak_price_period": {
            "description": "Of het huidige interval tot de duurste van de dag behoort",
            "long_description": "Wordt geactiveerd wanneer de huidige prijs in de top 20% van de prijzen van vandaag ligt",
            "usage_tips": "Gebruik dit om te voorkomen dat u apparaten met hoog verbruik draait tijdens dure intervallen"
        },
        "best_price_period": {
            "description": "Of het huidige interval tot de goedkoopste van de dag behoort",
            "long_description": "Wordt geactiveerd wanneer de huidige prijs in de onderste 20% van de prijzen van vandaag ligt",
            "usage_tips": "Gebruik dit om apparaten met hoog verbruik te laten draaien tijdens de goedkoopste intervallen"
        },
        "connection": {
            "description": "Of de verbinding met de Tibber API werkt",
            "long_description": "Geeft aan of de integratie succesvol verbinding kan maken met de Tibber API",
            "usage_tips": "Gebruik dit om de verbindingsstatus met de Tibber API te monitoren"
        }
    },
    "home_types": {
        "APARTMENT": "Appartement",
        "ROWHOUSE": "Rijhuis",
        "HOUSE": "Huis",
        "COTTAGE": "Huisje"
    }
}
