{
    "apexcharts": {
        "title_rating_level": "Prisfaser dagsprogress",
        "title_level": "Prisnivå",
        "best_price_period_name": "Bästa prisperiod",
        "notification": {
            "metadata_sensor_unavailable": {
                "title": "Tibber Prices: ApexCharts YAML genererad med begränsad funktionalitet",
                "message": "Du har precis genererat en ApexCharts-kortkonfiguration via Utvecklarverktyg. Diagram-metadata-sensorn är inaktiverad, så den genererade YAML:en visar bara **grundläggande funktionalitet** (auto-skalning, fast gradient vid 50%).\n\n**För full funktionalitet** (optimerad skalning, dynamiska gradientfärger):\n1. [Öppna Tibber Prices-integrationen](https://my.home-assistant.io/redirect/integration/?domain=tibber_prices)\n2. Aktivera 'Chart Metadata'-sensorn\n3. **Generera YAML:en igen** via Utvecklarverktyg\n4. **Ersätt den gamla YAML:en** i din instrumentpanel med den nya versionen\n\n⚠️ Det räcker inte att bara aktivera sensorn - du måste regenerera och ersätta YAML-koden!"
            },
            "missing_cards": {
                "title": "Tibber Prices: ApexCharts YAML kan inte användas",
                "message": "Du har precis genererat en ApexCharts-kortkonfiguration via Utvecklarverktyg, men den genererade YAML:en **kommer inte att fungera** eftersom nödvändiga anpassade kort saknas.\n\n**Saknade kort:**\n{cards}\n\n**För att använda den genererade YAML:en:**\n1. Klicka på länkarna ovan för att installera de saknade korten från HACS\n2. Starta om Home Assistant (ibland nödvändigt)\n3. **Generera YAML:en igen** via Utvecklarverktyg\n4. Lägg till YAML:en i din instrumentpanel\n\n⚠️ Den nuvarande YAML-koden fungerar inte förrän alla kort är installerade!"
            }
        }
    },
    "sensor": {
        "current_interval_price": {
            "description": "Det nuvarande elpriset per kWh",
            "long_description": "Visar nuvarande pris per kWh från ditt Tibber-abonnemang",
            "usage_tips": "Använd detta för att spåra priser eller skapa automationer som körs när el är billig"
        },
        "current_interval_price_major": {
            "description": "Nuvarande elpris i huvudvaluta (EUR/kWh, NOK/kWh, osv.) för Energipanelen",
            "long_description": "Visar nuvarande pris per kWh i huvudvaluta-enheter (t.ex. EUR/kWh istället för ct/kWh, NOK/kWh istället för øre/kWh). Denna sensor är speciellt utformad för användning med Home Assistants Energipanel, som kräver priser i standardvalutaenheter.",
            "usage_tips": "Använd denna sensor när du konfigurerar Energipanelen under Inställningar → Instrumentpaneler → Energi. Välj denna sensor som 'Entitet med nuvarande pris' för att automatiskt beräkna dina energikostnader. Energipanelen multiplicerar din energiförbrukning (kWh) med detta pris för att visa totala kostnader."
        },
        "next_interval_price": {
            "description": "Nästa intervalls elpris per kWh",
            "long_description": "Visar priset för nästa 15-minuters intervall från ditt Tibber-abonnemang",
            "usage_tips": "Använd detta för att förbereda dig för kommande prisändringar eller schemalägga enheter att köras under billigare intervaller"
        },
        "previous_interval_price": {
            "description": "Föregående intervalls elpris per kWh",
            "long_description": "Visar priset för föregående 15-minuters intervall från ditt Tibber-abonnemang",
            "usage_tips": "Använd detta för att granska tidigare prisändringar eller spåra prishistorik"
        },
        "current_hour_average_price": {
            "description": "Rullande 5-intervalls genomsnittspris per kWh",
            "long_description": "Visar genomsnittspriset per kWh beräknat från 5 intervaller: 2 föregående, nuvarande och 2 nästa intervaller (ungefär 75 minuter totalt). Detta ger ett utjämnat 'timpris' som anpassar sig när tiden går, istället för att vara fixerat till klockslag.",
            "usage_tips": "Använd detta för en stabilare prisindikator som jämnar ut kortsiktiga fluktuationer medan den fortfarande är responsiv till prisändringar. Bättre än fasta timpriser för konsumtionsbeslut."
        },
        "next_hour_average_price": {
            "description": "Rullande 5-intervalls genomsnittspris för nästa timme per kWh",
            "long_description": "Visar genomsnittspriset per kWh beräknat från 5 intervaller centrerade en timme framåt: ungefär intervaller +2 till +6 från nu (täcker minuter +30 till +105). Detta ger ett framåtblickande utjämnat 'timpris' för konsumtionsplanering.",
            "usage_tips": "Använd detta för att förutse prisändringar nästa timme. Användbart för att schemalägga högkonsumtionsaktiviteter som laddning av elfordon, körning av diskmaskiner eller värmesystem."
        },
        "lowest_price_today": {
            "description": "Det lägsta elpriset för idag per kWh",
            "long_description": "Visar det lägsta priset per kWh för nuvarande dag från ditt Tibber-abonnemang",
            "usage_tips": "Använd detta för att jämföra nuvarande priser med den billigaste tiden på dagen"
        },
        "highest_price_today": {
            "description": "Det högsta elpriset för idag per kWh",
            "long_description": "Visar det högsta priset per kWh för nuvarande dag från ditt Tibber-abonnemang",
            "usage_tips": "Använd detta för att undvika att köra apparater under topppristider"
        },
        "average_price_today": {
            "description": "Det genomsnittliga elpriset för idag per kWh",
            "long_description": "Visar genomsnittspriset per kWh för nuvarande dag från ditt Tibber-abonnemang",
            "usage_tips": "Använd detta som baslinje för att jämföra nuvarande priser"
        },
        "lowest_price_tomorrow": {
            "description": "Det lägsta elpriset för imorgon per kWh",
            "long_description": "Visar det lägsta priset per kWh för morgondagen från ditt Tibber-abonnemang. Denna sensor blir otillgänglig tills morgondagens data publiceras av Tibber (vanligtvis runt 13:00-14:00 CET).",
            "usage_tips": "Använd detta för att planera energikrävande aktiviteter för morgondagens billigaste tid. Perfekt för förhandsplanering av uppvärmning, EV-laddning eller apparater."
        },
        "highest_price_tomorrow": {
            "description": "Det högsta elpriset för imorgon per kWh",
            "long_description": "Visar det högsta priset per kWh för morgondagen från ditt Tibber-abonnemang. Denna sensor blir otillgänglig tills morgondagens data publiceras av Tibber (vanligtvis runt 13:00-14:00 CET).",
            "usage_tips": "Använd detta för att undvika att köra apparater under morgondagens topppristider. Användbart för att planera runt dyra perioder."
        },
        "average_price_tomorrow": {
            "description": "Det genomsnittliga elpriset för imorgon per kWh",
            "long_description": "Visar genomsnittspriset per kWh för morgondagen från ditt Tibber-abonnemang. Denna sensor blir otillgänglig tills morgondagens data publiceras av Tibber (vanligtvis runt 13:00-14:00 CET).",
            "usage_tips": "Använd detta som baslinje för att jämföra morgondagens priser och planera konsumtion. Jämför med dagens genomsnitt för att se om morgondagen kommer att bli dyrare eller billigare totalt sett."
        },
        "yesterday_price_level": {
            "description": "Aggregerad prisnivå för igår",
            "long_description": "Visar den aggregerade prisnivån för alla intervall igår. Använder samma logik som timsensorerna för att bestämma den totala prisnivån för hela dagen.",
            "usage_tips": "Använd detta för att förstå den övergripande prissituationen igår. Jämför med idag för att se dagliga trender."
        },
        "today_price_level": {
            "description": "Aggregerad prisnivå för idag",
            "long_description": "Visar den aggregerade prisnivån för alla intervall idag. Använder samma logik som timsensorerna för att bestämma den totala prisnivån för hela dagen.",
            "usage_tips": "Använd detta för att förstå dagens prissituation snabbt. Praktiskt för snabba bedömningar om dagen i allmänhet är billig eller dyr."
        },
        "tomorrow_price_level": {
            "description": "Aggregerad prisnivå för imorgon",
            "long_description": "Visar den aggregerade prisnivån för alla intervall imorgon. Använder samma logik som timsensorerna för att bestämma den totala prisnivån för hela dagen. Denna sensor blir otillgänglig tills morgondagens data publiceras av Tibber (vanligtvis runt 13:00-14:00 CET).",
            "usage_tips": "Använd detta för att förstå imorgonens prissituation. Jämför med idag för att se om imorgon blir mer eller mindre gynnsamt för energiförbrukning."
        },
        "yesterday_price_rating": {
            "description": "Aggregerad prisvärdering för igår",
            "long_description": "Visar den aggregerade prisvärderingen (låg/normal/hög) för alla intervall igår, baserat på dina konfigurerade tröskelvärden. Använder samma logik som timsensorerna för att bestämma den totala värderingen för hela dagen.",
            "usage_tips": "Använd detta för att förstå igårens prissituation i förhållande till dina personliga tröskelvärden. Jämför med idag för trendanalys."
        },
        "today_price_rating": {
            "description": "Aggregerad prisvärdering för idag",
            "long_description": "Visar den aggregerade prisvärderingen (låg/normal/hög) för alla intervall idag, baserat på dina konfigurerade tröskelvärden. Använder samma logik som timsensorerna för att bestämme den totala värderingen för hela dagen.",
            "usage_tips": "Använd detta för att snabbt bedöma dagens prissituation i förhållande till dina personliga tröskelvärden. Hjälper till att fatta förbrukningsbeslut för innevarande dag."
        },
        "tomorrow_price_rating": {
            "description": "Aggregerad prisvärdering för imorgon",
            "long_description": "Visar den aggregerade prisvärderingen (låg/normal/hög) för alla intervall imorgon, baserat på dina konfigurerade tröskelvärden. Använder samma logik som timsensorerna för att bestämma den totala värderingen för hela dagen. Denna sensor blir otillgänglig tills morgondagens data publiceras av Tibber (vanligtvis runt 13:00-14:00 CET).",
            "usage_tips": "Använd detta för att planera imorgonens energiförbrukning baserat på dina personliga priströskelvärden. Jämför med idag för att avgöra om du ska skjuta upp förbrukning till imorgon eller använda energi idag."
        },
        "trailing_price_average": {
            "description": "Det genomsnittliga elpriset för de senaste 24 timmarna per kWh",
            "long_description": "Visar genomsnittspriset per kWh beräknat från de senaste 24 timmarna (rullande genomsnitt) från ditt Tibber-abonnemang. Detta ger ett rullande genomsnitt som uppdateras var 15:e minut baserat på historiska data.",
            "usage_tips": "Använd detta för att jämföra nuvarande priser mot senaste trender. Ett nuvarande pris som ligger väsentligt över detta genomsnitt kan indikera ett bra tillfälle att minska konsumtionen."
        },
        "leading_price_average": {
            "description": "Det genomsnittliga elpriset för nästa 24 timmar per kWh",
            "long_description": "Visar genomsnittspriset per kWh beräknat från nästa 24 timmar (framåtblickande genomsnitt) från ditt Tibber-abonnemang. Detta ger ett framåtblickande genomsnitt baserat på tillgängliga prognosdata.",
            "usage_tips": "Använd detta för att planera energianvändning. Om nuvarande pris är under det framåtblickande genomsnittet kan det vara ett bra tillfälle att köra energikrävande apparater."
        },
        "trailing_price_min": {
            "description": "Det minsta elpriset för de senaste 24 timmarna per kWh",
            "long_description": "Visar minimipriset per kWh från de senaste 24 timmarna (rullande minimum) från ditt Tibber-abonnemang. Detta ger det lägsta priset som setts de senaste 24 timmarna.",
            "usage_tips": "Använd detta för att se den bästa prismöjligheten du hade de senaste 24 timmarna och jämför med nuvarande priser."
        },
        "trailing_price_max": {
            "description": "Det maximala elpriset för de senaste 24 timmarna per kWh",
            "long_description": "Visar maximipriset per kWh från de senaste 24 timmarna (rullande maximum) från ditt Tibber-abonnemang. Detta ger det högsta priset som setts de senaste 24 timmarna.",
            "usage_tips": "Använd detta för att se topppriset de senaste 24 timmarna och bedöma prisvolatilitet."
        },
        "leading_price_min": {
            "description": "Det minsta elpriset för nästa 24 timmar per kWh",
            "long_description": "Visar minimipriset per kWh från nästa 24 timmar (framåtblickande minimum) från ditt Tibber-abonnemang. Detta ger det lägsta priset som förväntas nästa 24 timmar baserat på prognosdata.",
            "usage_tips": "Använd detta för att identifiera den bästa prismöjligheten som kommer och planera energikrävande uppgifter därefter."
        },
        "leading_price_max": {
            "description": "Det maximala elpriset för nästa 24 timmar per kWh",
            "long_description": "Visar maximipriset per kWh från nästa 24 timmar (framåtblickande maximum) från ditt Tibber-abonnemang. Detta ger det högsta priset som förväntas nästa 24 timmar baserat på prognosdata.",
            "usage_tips": "Använd detta för att undvika att köra apparater under kommande toppprisperioder."
        },
        "current_interval_price_level": {
            "description": "Den nuvarande prisnivåklassificeringen",
            "long_description": "Visar Tibbers klassificering av nuvarande pris jämfört med historiska priser",
            "usage_tips": "Använd detta för att skapa automationer baserade på relativa prisnivåer istället för absoluta priser"
        },
        "next_interval_price_level": {
            "description": "Prisnivå för nästa 15-minuters intervall",
            "long_description": "Visar prisnivåklassificeringen för kommande intervall. Hjälper att förutse kortsiktiga prisändringar för omedelbar planering.",
            "usage_tips": "Använd för snabba beslut om att starta eller stoppa högeffektsenheter inom de kommande minuterna."
        },
        "previous_interval_price_level": {
            "description": "Prisnivå för föregående 15-minuters intervall",
            "long_description": "Visar prisnivåklassificeringen för senaste intervallet. Användbart för historisk jämförelse och förståelse av senaste pristrender.",
            "usage_tips": "Använd för att jämföra nuvarande vs senaste prisnivåer eller analysera konsumtionsmönster mot historiska priser."
        },
        "current_hour_price_level": {
            "description": "Aggregerad prisnivå för nuvarande rullande timme (5 intervaller)",
            "long_description": "Visar median prisnivå över 5 intervaller (2 före, nuvarande, 2 efter) som täcker ungefär 75 minuter. Ger en stabilare prisnivåindikator som jämnar ut kortsiktiga fluktuationer.",
            "usage_tips": "Använd för planeringsbeslut på medellång sikt där du vill undvika att reagera på korta pristoppar eller -fall."
        },
        "next_hour_price_level": {
            "description": "Aggregerad prisnivå för nästa rullande timme (5 intervaller framåt)",
            "long_description": "Visar median prisnivå över 5 intervaller centrerade en timme framåt. Hjälper att planera konsumtion baserat på kommande pristrender istället för ögonblickliga framtida priser.",
            "usage_tips": "Använd för att schemalägga aktiviteter för nästa timme baserat på en utjämnad prisnivåprognos."
        },
        "current_interval_price_rating": {
            "description": "Hur nuvarande intervalls pris jämförs med historiska data",
            "long_description": "Visar hur nuvarande intervalls pris jämförs med historiska prisdata som en procentsats",
            "usage_tips": "En positiv procentsats betyder att nuvarande pris är över genomsnittet, negativ betyder under genomsnittet"
        },
        "next_interval_price_rating": {
            "description": "Prisvärdering för nästa 15-minuters intervall",
            "long_description": "Visar hur nästa intervalls pris jämförs med det rullande 24-timmars genomsnittet. Hjälper att förutse om kommande priser är över eller under den senaste trenden.",
            "usage_tips": "Använd för att fatta snabba beslut om att starta aktiviteter i nästa intervall baserat på relativ prisposition."
        },
        "previous_interval_price_rating": {
            "description": "Prisvärdering för föregående 15-minuters intervall",
            "long_description": "Visar hur senaste intervalls pris jämfördes med det rullande genomsnittet. Användbart för att förstå senaste prisbeteende.",
            "usage_tips": "Använd för att analysera hur prisvärderingar förändrades över tid eller validera tidigare konsumtionsbeslut."
        },
        "current_hour_price_rating": {
            "description": "Aggregerad prisvärdering för nuvarande rullande timme (5 intervaller)",
            "long_description": "Visar genomsnittlig värdering över 5 intervaller (2 före, nuvarande, 2 efter). Baserad på genomsnittlig procentuell skillnad från rullande 24t genomsnitt, vilket ger en utjämnad värderingsindikator.",
            "usage_tips": "Använd för stabil prisvärdering på medellång sikt som inte överreagerar på korta prisavvikelser."
        },
        "next_hour_price_rating": {
            "description": "Aggregerad prisvärdering för nästa rullande timme (5 intervaller framåt)",
            "long_description": "Visar genomsnittlig värdering för 5 intervaller centrerade en timme framåt. Hjälper att förstå om nästa timme generellt kommer att ligga över eller under genomsnittlig prissättning.",
            "usage_tips": "Använd för att bestämma om du ska vänta en timme innan du startar högkonsumtionsaktiviteter."
        },
        "next_avg_1h": {
            "description": "Genomsnittspris för nästa 1 timme (endast framåt från nästa intervall)",
            "long_description": "Framåtblickande genomsnitt: Visar genomsnitt av nästa 4 intervaller (1 timme) från och med NÄSTA 15-minuters intervall (inte inklusive nuvarande). Skiljer sig från current_hour_average_price som inkluderar tidigare intervaller. Använd för absolut priströskelpla nering.",
            "usage_tips": "Absolut priströskel: Starta endast apparater när genomsnittet stannar under ditt maximalt acceptabla pris (t.ex. under 0,25 EUR/kWh). Kombinera med trendsensor för optimal timing. Obs: Detta är INTE en ersättning för timpriser - använd current_hour_average_price för det."
        },
        "next_avg_2h": {
            "description": "Genomsnittspris för nästa 2 timmar",
            "long_description": "Visar genomsnittspriset för nästa 8 intervaller (2 timmar) från och med nästa 15-minuters intervall.",
            "usage_tips": "Absolut priströskel: Sätt ett maximalt acceptabelt genomsnittspris för standardapparater som tvättmaskiner. Säkerställer att du aldrig betalar mer än din gräns."
        },
        "next_avg_3h": {
            "description": "Genomsnittspris för nästa 3 timmar",
            "long_description": "Visar genomsnittspriset för nästa 12 intervaller (3 timmar) från och med nästa 15-minuters intervall.",
            "usage_tips": "Absolut priströskel: För EU Eco-program (diskmaskiner, 3-4t körtid). Starta endast när 3t genomsnitt är under din prisgräns. Använd med trendsensor för att hitta bästa ögonblick inom acceptabelt prisområde."
        },
        "next_avg_4h": {
            "description": "Genomsnittspris för nästa 4 timmar",
            "long_description": "Visar genomsnittspriset för nästa 16 intervaller (4 timmar) från och med nästa 15-minuters intervall.",
            "usage_tips": "Absolut priströskel: Sätt maximalt acceptabelt pris för värmepumpar eller varmvattenberedare. Förhindrar drift under dyra perioder oavsett relativa trender."
        },
        "next_avg_5h": {
            "description": "Genomsnittspris för nästa 5 timmar",
            "long_description": "Visar genomsnittspriset för nästa 20 intervaller (5 timmar) från och med nästa 15-minuters intervall.",
            "usage_tips": "Absolut priströskel: Brygga mellan kort och lång sikt planering. Använd för utökade cykler med hårda prisgränser (t.ex. poolpumpar, utökade uppvärmningscykler)."
        },
        "next_avg_6h": {
            "description": "Genomsnittspris för nästa 6 timmar",
            "long_description": "Visar genomsnittspriset för nästa 24 intervaller (6 timmar) från och med nästa 15-minuters intervall.",
            "usage_tips": "Absolut priströskel: Kvällsplanering med pristak. Schemalägg endast uppgifter om 6t genomsnitt stannar under dina maximalt acceptabla kostnader."
        },
        "next_avg_8h": {
            "description": "Genomsnittspris för nästa 8 timmar",
            "long_description": "Visar genomsnittspriset för nästa 32 intervaller (8 timmar) från och med nästa 15-minuters intervall.",
            "usage_tips": "Absolut priströskel: Nattliga driftsbeslut. Sätt hårda prisgränser för nattliga laster (batteriladdning, termisk lagring). Överskrid aldrig din budget."
        },
        "next_avg_12h": {
            "description": "Genomsnittspris för nästa 12 timmar",
            "long_description": "Visar genomsnittspriset för nästa 48 intervaller (12 timmar) från och med nästa 15-minuters intervall.",
            "usage_tips": "Absolut priströskel: Strategiska beslut med pristak. Fortsätt endast om 12t genomsnitt är under ditt maximalt acceptabla pris. Bra för uppskjutbara stora laster."
        },
        "price_trend_1h": {
            "description": "Pristrend för nästa timme",
            "long_description": "Jämför nuvarande intervallpris med genomsnitt av nästa 1 timme (4 intervaller). Stigande om framtid är >5% högre, fallande om >5% lägre, annars stabil.",
            "usage_tips": "Relativ optimering: 'fallande' = vänta, priser sjunker. 'stigande' = agera nu eller du betalar mer. 'stabil' = pris spelar ingen större roll nu. Fungerar oberoende av absolut prisnivå."
        },
        "price_trend_2h": {
            "description": "Pristrend för nästa 2 timmar",
            "long_description": "Jämför nuvarande intervallpris med genomsnitt av nästa 2 timmar (8 intervaller). Stigande om framtid är >5% högre, fallande om >5% lägre, annars stabil.",
            "usage_tips": "Relativ optimering: Idealisk för apparater. 'fallande' betyder bättre priser kommer om 2t - skjut upp om möjligt. Hittar bästa timing inom ditt tillgängliga fönster, oavsett säsong."
        },
        "price_trend_3h": {
            "description": "Pristrend för nästa 3 timmar",
            "long_description": "Jämför nuvarande intervallpris med genomsnitt av nästa 3 timmar (12 intervaller). Stigande om framtid är >5% högre, fallande om >5% lägre, annars stabil.",
            "usage_tips": "Relativ optimering: För Eco-program. 'fallande' betyder priser sjunker >5% - värt att vänta. Fungerar under alla säsonger. Kombinera med avg-sensor för prisgräns: endast när avg < din gräns OCH trend inte 'fallande'."
        },
        "price_trend_4h": {
            "description": "Pristrend för nästa 4 timmar",
            "long_description": "Jämför nuvarande intervallpris med genomsnitt av nästa 4 timmar (16 intervaller). Stigande om framtid är >5% högre, fallande om >5% lägre, annars stabil.",
            "usage_tips": "Relativ optimering: Värmepump/batteribeslut. 'fallande' betyder bättre laddningsfönster kommer. Hittar alltid relativt bästa tid - oavsett om priserna är 10 öre eller 50 öre. Använd avg-sensor för absolut gräns."
        },
        "price_trend_5h": {
            "description": "Pristrend för nästa 5 timmar",
            "long_description": "Jämför nuvarande intervallpris med genomsnitt av nästa 5 timmar (20 intervaller). Stigande om framtid är >5% högre, fallande om >5% lägre, annars stabil.",
            "usage_tips": "Relativ optimering: Utökade operationer. Anpassar sig till marknaden - hittar bästa relativa timing i vilken prismiljö som helst. 'stabil/stigande' = bra tid att starta inom ditt planeringsfönster."
        },
        "price_trend_6h": {
            "description": "Pristrend för nästa 6 timmar",
            "long_description": "Jämför nuvarande intervallpris med genomsnitt av nästa 6 timmar (24 intervaller). Stigande om framtid är >5% högre, fallande om >5% lägre, annars stabil.",
            "usage_tips": "Relativ optimering: Kvällsbeslut. 'fallande' = priser förbättras avsevärt om du väntar. Inga fasta trösklar behövs - justerar automatiskt till vinter/sommar prisnivåer."
        },
        "price_trend_8h": {
            "description": "Pristrend för nästa 8 timmar",
            "long_description": "Jämför nuvarande intervallpris med genomsnitt av nästa 8 timmar (32 intervaller). Stigande om framtid är >5% högre, fallande om >5% lägre, annars stabil.",
            "usage_tips": "Relativ optimering: Nattplanering. 'fallande' betyder att vänta till natten lönar sig (>5% billigare). Fungerar året runt utan manuella tröskel justeringar. Starta när 'stabil' eller 'stigande'."
        },
        "price_trend_12h": {
            "description": "Pristrend för nästa 12 timmar",
            "long_description": "Jämför nuvarande intervallpris med genomsnitt av nästa 12 timmar (48 intervaller). Stigande om framtid är >5% högre, fallande om >5% lägre, annars stabil.",
            "usage_tips": "Relativ optimering: Långsiktiga strategiska beslut. 'fallande' = avsevärt bättre priser kommer ikväll/imorgon. Hittar optimal timing i vilket marknadsläge som helst. Bäst kombinerad med avg-sensor prisgräns."
        },
        "current_price_trend": {
            "description": "Nuvarande pristrend-riktning och hur länge den varar",
            "long_description": "Visar nuvarande pristrend (stigande/fallande/stabil) genom att kombinera historiskt momentum (viktad 1h tillbakablick) med framtidsutsikt. Känner igen pågående trender tidigare än endast framtidsanalys. Använder ±3 % momentum-tröskel och volatilitetsanpassad framtidsjämförelse. Beräknar dynamiskt till nästa trendändring (eller 3t standard om ingen ändring på 24t). Status visar nuvarande riktning, attribut visar när den ändras och vad som kommer härnäst.",
            "usage_tips": "Statusvisning: Dashboard-synlighet av 'vad händer nu till när'. Perfekt synkroniserad med next_price_trend_change. Exempel: Badge som visar 'Stigande i 2,5t' eller 'Fallande till 16:45'. Bättre än tidsfönster-sensorer eftersom den förstår att du REDAN är i en trend, inte bara förutsäger framtida ändringar. Använd för snabb visuell överblick, inte automationsutlösare."
        },
        "next_price_trend_change": {
            "description": "När nästa betydande pristrendändring kommer att inträffa",
            "long_description": "Skannar de nästa 24 timmarna (96 intervaller) för att hitta när pristrenden (stigande/fallande/stabil) kommer att ändras från nuvarande momentum. Bestämmer först nuvarande trend med viktad 1h tillbakablick (känner igen pågående trender), hittar sedan reverseringen. Använder volatilitetsadaptiva tröskelvärden (3 % momentum-detektering, marknadsanpassad framtidsjämförelse). Returnerar tidsstämpeln när ändringen förväntas.",
            "usage_tips": "Händelsestyrd automatisering: Utlös åtgärder NÄR trenden ändras, inte OM X timmar. Exempel: 'Ladda EV när nästa trendändring visar fallande priser' eller 'Starta diskmaskin innan priserna stiger'. Kompletterar tidsfönster-sensorer (price_trend_Xh) som svarar på 'KOMMER priserna att vara högre om X timmar?'"
        },
        "daily_rating": {
            "description": "Hur dagens priser jämförs med historiska data",
            "long_description": "Visar hur dagens priser jämförs med historiska prisdata som en procentsats",
            "usage_tips": "En positiv procentsats betyder att dagens priser är över genomsnittet, negativ betyder under genomsnittet"
        },
        "monthly_rating": {
            "description": "Hur denna månads priser jämförs med historiska data",
            "long_description": "Visar hur denna månads priser jämförs med historiska prisdata som en procentsats",
            "usage_tips": "En positiv procentsats betyder att denna månads priser är över genomsnittet, negativ betyder under genomsnittet"
        },
        "data_timestamp": {
            "description": "Tidsstämpel för senaste tillgängliga prisdataintervall",
            "long_description": "Visar tidsstämpeln för det senaste tillgängliga prisdataintervallet från ditt Tibber-abonnemang"
        },
        "today_volatility": {
            "description": "Prisvolatilitetsklassificering för idag",
            "long_description": "Visar hur mycket elpriserna varierar under dagen baserat på spridningen (skillnaden mellan högsta och lägsta pris). Klassificering: LÅG = spridning < 5 öre, MÅTTLIG = 5-15 öre, HÖG = 15-30 öre, MYCKET HÖG = >30 öre.",
            "usage_tips": "Använd detta för att avgöra om prisbaserad optimering är värt besväret. Till exempel, med ett balkongbatteri som har 15% effektivitetsförlust är optimering endast meningsfull när volatiliteten är åtminstone MÅTTLIG. Skapa automationer som kontrollerar volatiliteten innan laddnings-/urladdningscykler planeras."
        },
        "tomorrow_volatility": {
            "description": "Prisvolatilitetsklassificering för imorgon",
            "long_description": "Visar hur mycket elpriserna kommer att variera under morgondagen baserat på spridningen (skillnaden mellan högsta och lägsta pris). Blir otillgänglig tills morgondagens data publiceras (vanligtvis 13:00-14:00 CET).",
            "usage_tips": "Använd detta för förhandsplanering av morgondagens energianvändning. Om morgondagen har HÖG eller MYCKET HÖG volatilitet är det värt att optimera energiförbrukningstiming. Vid LÅG volatilitet kan du köra enheter när som helst utan betydande kostnadsskillnader."
        },
        "next_24h_volatility": {
            "description": "Prisvolatilitetsklassificering för rullande nästa 24 timmar",
            "long_description": "Visar hur mycket elpriserna varierar under de nästa 24 timmarna från nu (rullande fönster). Detta korsar daggränser och uppdateras var 15:e minut, vilket ger en framåtblickande volatilitetsbedömning oberoende av kalenderdagar.",
            "usage_tips": "Bästa sensorn för realtidsoptimeringsbeslut. Till skillnad från idag/imorgon-sensorer som växlar vid midnatt ger detta en kontinuerlig 24t volatilitetsbedömning. Använd för batteriladningsstrategier som sträcker sig över daggränser."
        },
        "today_tomorrow_volatility": {
            "description": "Kombinerad prisvolatilitetsklassificering för idag och imorgon",
            "long_description": "Visar volatilitet över både idag och imorgon kombinerat (när morgondagens data är tillgänglig). Ger en utökad vy av prisvariation över upp till 48 timmar. Faller tillbaka till endast idag när morgondagens data inte är tillgänglig ännu.",
            "usage_tips": "Använd detta för flerdagarsplanering och för att förstå om prismöjligheter existerar över dagsgränsen. Attributen 'today_volatility' och 'tomorrow_volatility' visar individuella dagsbidrag. Användbart för planering av laddningssessioner som kan sträcka sig över midnatt."
        },
        "data_lifecycle_status": {
            "description": "Aktuell status för prisdatalivscykel och cachning",
            "long_description": "Visar om integrationen använder cachad data eller färsk data från API:et. Visar aktuell livscykelstatus: 'cached' (använder lagrad data), 'fresh' (nyss hämtad från API), 'refreshing' (hämtar för närvarande), 'searching_tomorrow' (söker aktivt efter morgondagens data efter 13:00), 'turnover_pending' (inom 15 minuter före midnatt, 23:45-00:00), eller 'error' (hämtning misslyckades). Inkluderar omfattande attribut som cache-ålder, nästa API-polling, datafullständighet och API-anropsstatistik.",
            "usage_tips": "Använd denna diagnostiksensor för att förstå datafärskhet och API-anropsmönster. Kontrollera 'cache_age'-attributet för att se hur gammal den aktuella datan är. Övervaka 'next_api_poll' för att veta när nästa uppdatering är schemalagd. Använd 'data_completeness' för att se om data för igår/idag/imorgon är tillgänglig. Räknaren 'api_calls_today' hjälper till att spåra API-användning. Perfekt för felsökning eller förståelse av integrationens beteende."
        },
        "best_price_end_time": {
            "description": "När nuvarande eller nästa billigperiod slutar",
            "long_description": "Visar sluttidsstämpeln för nuvarande billigperiod när aktiv, eller slutet av nästa period när ingen period är aktiv. Visar alltid en användbar tidsreferens för planering. Returnerar 'Okänt' endast när inga perioder är konfigurerade.",
            "usage_tips": "Använd detta för att visa en nedräkning som 'Billigperiod slutar om 2 timmar' (när aktiv) eller 'Nästa billigperiod slutar kl 14:00' (när inaktiv). Home Assistant visar automatiskt relativ tid för tidsstämpelsensorer."
        },
        "best_price_remaining_minutes": {
            "description": "Återstående minuter i nuvarande billigperiod (0 när inaktiv)",
            "long_description": "Visar hur många minuter som återstår i nuvarande billigperiod. Returnerar 0 när ingen period är aktiv. Uppdateras varje minut. Kontrollera binary_sensor.best_price_period för att se om en period är aktiv.",
            "usage_tips": "Perfekt för automationer: 'Om remaining_minutes > 0 OCH remaining_minutes < 30, starta tvättmaskin nu'. Värdet 0 gör det enkelt att kontrollera om en period är aktiv (värde > 0) eller inte (värde = 0)."
        },
        "best_price_progress": {
            "description": "Framsteg genom nuvarande billigperiod (0% när inaktiv)",
            "long_description": "Visar framsteg genom nuvarande billigperiod som 0-100%. Returnerar 0% när ingen period är aktiv. Uppdateras varje minut. 0% betyder period just startad, 100% betyder den snart slutar.",
            "usage_tips": "Bra för visuella framstegsstaplar. Använd i automationer: 'Om progress > 0 OCH progress > 75, skicka meddelande att billigperiod snart slutar'. Värde 0 indikerar ingen aktiv period."
        },
        "best_price_next_start_time": {
            "description": "När nästa billigperiod startar",
            "long_description": "Visar när nästa kommande billigperiod startar. Under en aktiv period visar detta starten av NÄSTA period efter den nuvarande. Returnerar 'Okänt' endast när inga framtida perioder är konfigurerade.",
            "usage_tips": "Alltid användbart för framåtplanering: 'Nästa billigperiod startar om 3 timmar' (oavsett om du är i en period nu eller inte). Kombinera med automationer: 'När nästa starttid är om 10 minuter, skicka meddelande för att förbereda tvättmaskin'."
        },
        "best_price_next_in_minutes": {
            "description": "Minuter tills nästa billigperiod startar (0 vid övergång)",
            "long_description": "Visar minuter tills nästa billigperiod startar. Under en aktiv period visar detta tiden till perioden EFTER den nuvarande. Returnerar 0 under korta övergångsmoment. Uppdateras varje minut.",
            "usage_tips": "Perfekt för 'vänta tills billigperiod' automationer: 'Om next_in_minutes > 0 OCH next_in_minutes < 15, vänta innan diskmaskin startas'. Värde > 0 indikerar alltid att en framtida period är planerad."
        },
        "peak_price_end_time": {
            "description": "När nuvarande eller nästa dyrperiod slutar",
            "long_description": "Visar sluttidsstämpeln för nuvarande dyrperiod när aktiv, eller slutet av nästa period när ingen period är aktiv. Visar alltid en användbar tidsreferens för planering. Returnerar 'Okänt' endast när inga perioder är konfigurerade.",
            "usage_tips": "Använd detta för att visa 'Dyrperiod slutar om 1 timme' (när aktiv) eller 'Nästa dyrperiod slutar kl 18:00' (när inaktiv). Kombinera med automationer för att återuppta drift efter topp."
        },
        "peak_price_remaining_minutes": {
            "description": "Återstående minuter i nuvarande dyrperiod (0 när inaktiv)",
            "long_description": "Visar hur många minuter som återstår i nuvarande dyrperiod. Returnerar 0 när ingen period är aktiv. Uppdateras varje minut. Kontrollera binary_sensor.peak_price_period för att se om en period är aktiv.",
            "usage_tips": "Använd i automationer: 'Om remaining_minutes > 60, avbryt uppskjuten laddningssession'. Värde 0 gör det enkelt att skilja mellan aktiva (värde > 0) och inaktiva (värde = 0) perioder."
        },
        "peak_price_progress": {
            "description": "Framsteg genom nuvarande dyrperiod (0% när inaktiv)",
            "long_description": "Visar framsteg genom nuvarande dyrperiod som 0-100%. Returnerar 0% när ingen period är aktiv. Uppdateras varje minut.",
            "usage_tips": "Visuell framstegsindikator i instrumentpaneler. Automation: 'Om progress > 0 OCH progress > 90, förbered normal värmeplanering'. Värde 0 indikerar ingen aktiv period."
        },
        "peak_price_next_start_time": {
            "description": "När nästa dyrperiod startar",
            "long_description": "Visar när nästa kommande dyrperiod startar. Under en aktiv period visar detta starten av NÄSTA period efter den nuvarande. Returnerar 'Okänt' endast när inga framtida perioder är konfigurerade.",
            "usage_tips": "Alltid användbart för planering: 'Nästa dyrperiod startar om 2 timmar'. Automation: 'När nästa starttid är om 30 minuter, minska värmetemperatur förebyggande'."
        },
        "peak_price_next_in_minutes": {
            "description": "Minuter tills nästa dyrperiod startar (0 vid övergång)",
            "long_description": "Visar minuter tills nästa dyrperiod startar. Under en aktiv period visar detta tiden till perioden EFTER den nuvarande. Returnerar 0 under korta övergångsmoment. Uppdateras varje minut.",
            "usage_tips": "Förebyggande automation: 'Om next_in_minutes > 0 OCH next_in_minutes < 10, slutför nuvarande laddcykel nu innan priserna ökar'."
        },
        "best_price_period_duration": {
            "description": "Total längd på nuvarande eller nästa billigperiod i minuter",
            "long_description": "Visar den totala längden på billigperioden i minuter. Under en aktiv period visar detta hela längden av nuvarande period. När ingen period är aktiv visar detta längden på nästa kommande period. Exempel: '90 minuter' för en 1,5-timmars period.",
            "usage_tips": "Kombinera med remaining_minutes för att planera uppgifter: 'Om duration = 120 OCH remaining_minutes > 90, starta tvättmaskin (tillräckligt med tid för att slutföra)'. Användbart för att förstå om perioder är tillräckligt långa för energikrävande uppgifter."
        },
        "peak_price_period_duration": {
            "description": "Total längd på nuvarande eller nästa dyrperiod i minuter",
            "long_description": "Visar den totala längden på dyrperioden i minuter. Under en aktiv period visar detta hela längden av nuvarande period. När ingen period är aktiv visar detta längden på nästa kommande period. Exempel: '60 minuter' för en 1-timmars period.",
            "usage_tips": "Använd för att planera energisparåtgärder: 'Om duration > 120, minska värmetemperatur mer aggressivt (lång dyr period)'. Hjälper till att bedöma hur mycket energiförbrukning måste minskas."
        },
        "home_type": {
            "description": "Bostadstyp (lägenhet, hus osv.)",
            "long_description": "Visar bostadstypen som konfigurerats i ditt Tibber-konto. Denna metadata kan vara användbar för att kategorisera energiförbrukningsmönster.",
            "usage_tips": "Använd detta för att organisera ditt smarthussystem eller för analysändamål."
        },
        "home_size": {
            "description": "Boyta i kvadratmeter",
            "long_description": "Visar storleken på din bostad i kvadratmeter som konfigurerats i ditt Tibber-konto. Kan användas för att beräkna energiförbrukning per kvadratmeter.",
            "usage_tips": "Använd detta i energieffektivitetsberäkningar: 'Min bostad använder X kWh per kvadratmeter per år'."
        },
        "main_fuse_size": {
            "description": "Huvudsäkringsstorlek i ampere",
            "long_description": "Visar kapaciteten på din huvudsäkring i ampere. Detta bestämmer den maximala elektriska belastningen din bostad kan hantera samtidigt.",
            "usage_tips": "Använd detta för att förhindra överbelastning: 'Om total strömförbrukning närmar sig säkringsstorleken, skjut upp start av ytterligare apparater'."
        },
        "number_of_residents": {
            "description": "Antal personer som bor i bostaden",
            "long_description": "Visar antalet boende som konfigurerats i ditt Tibber-konto. Användbart för beräkningar av energiförbrukning per person.",
            "usage_tips": "Använd detta för hushållets energianalyser: 'Energiförbrukning per person per dag'."
        },
        "primary_heating_source": {
            "description": "Primär värmesystemtyp",
            "long_description": "Visar typen av värmesystem som används i din bostad som konfigurerats i ditt Tibber-konto. Detta kan vara en värmepump, elektrisk uppvärmning, gas, olja eller andra värmekällor.",
            "usage_tips": "Använd detta för att kategorisera värmerelaterade automationer eller för energiförbrukningsanalys efter värmetyp."
        },
        "grid_company": {
            "description": "Namn på din elnätsoperatör",
            "long_description": "Visar namnet på företaget som driver elnätet i ditt område. Detta är distributionssystemoperatören (DSO) som ansvarar för att leverera elektricitet till ditt hem.",
            "usage_tips": "Användbart för administrativa ändamål och felsökning av nätrelaterade problem."
        },
        "grid_area_code": {
            "description": "Nätområdets identifieringskod",
            "long_description": "Visar koden som identifierar ditt elnätsområde. Denna kod används av nätoperatören för routing- och faktureringsändamål.",
            "usage_tips": "Använd detta som administrativ referens eller vid kontakt med din nätoperatör."
        },
        "price_area_code": {
            "description": "Elprisområdeskod",
            "long_description": "Visar koden för ditt elprisområde (t.ex. NO1, NO2, SE3, DK1). Olika områden har olika grossistelpriser baserat på regionalt utbud och efterfrågan.",
            "usage_tips": "Använd detta för att förstå vilket prisområde du befinner dig i. Användbart vid jämförelse av priser med andra eller analys av regionala prismönster."
        },
        "consumption_ean": {
            "description": "EAN-kod för elförbrukningsmätning",
            "long_description": "Visar European Article Number (EAN)-koden som unikt identifierar din elförbrukningsmätare. Denna 18-siffriga kod används för fakturerings- och administrativa ändamål.",
            "usage_tips": "Använd detta vid kommunikation med din elleverantör eller för administrativ dokumentation."
        },
        "production_ean": {
            "description": "EAN-kod för elproduktionsmätning",
            "long_description": "Visar European Article Number (EAN)-koden för din elproduktionsmätare (om du har solpaneler eller annan produktion). Denna kod spårar elektricitet du matar tillbaka till nätet.",
            "usage_tips": "Relevant om du har solpaneler eller annan elproduktion. Använd för administrativa ändamål och vid krav på inmatningsersättning."
        },
        "energy_tax_type": {
            "description": "Typ av energiskatt som tillämpas",
            "long_description": "Visar energiskattekategorin som tillämpas på din elförbrukning. Skattesatser varierar per land och ibland per konsumenttyp (privat, kommersiell osv.).",
            "usage_tips": "Använd detta för att förstå uppdelningen av din elräkning och för totala kostnadsberäkningar."
        },
        "vat_type": {
            "description": "Momskategori (mervärdesskatt)",
            "long_description": "Visar momskategorin som tillämpas på din elförbrukning. Momssatser varierar per land och kan skilja sig för elektricitet jämfört med andra varor och tjänster.",
            "usage_tips": "Använd detta för att förstå din elräkning och beräkna totala kostnader inklusive skatter."
        },
        "estimated_annual_consumption": {
            "description": "Uppskattat årligt elförbrukning i kWh",
            "long_description": "Visar din uppskattade årliga elförbrukning i kilowattimmar som beräknats eller konfigurerats i ditt Tibber-konto. Denna uppskattning används för att jämföra faktisk förbrukning med förväntade värden.",
            "usage_tips": "Använd detta för att spåra om din faktiska förbrukning är över eller under förväntningarna. Jämför månatlig förbrukning med 1/12 av detta värde för att identifiera ovanliga mönster."
        },
        "subscription_status": {
            "description": "Status för ditt Tibber-abonnemang",
            "long_description": "Visar om ditt Tibber-abonnemang för närvarande är aktivt, har avslutats eller väntar på aktivering. En status 'Aktiv' betyder att du aktivt tar emot elektricitet genom Tibber.",
            "usage_tips": "Använd detta för att övervaka din abonnemangsstatus. Ställ in varningar om statusen ändras från 'Aktiv' för att säkerställa oavbruten service."
        },
        "chart_data_export": {
            "description": "Dataexport för dashboard-integrationer",
            "long_description": "Denna sensor anropar get_chartdata-tjänsten med din konfigurerade YAML-konfiguration och exponerar resultatet som entitetsattribut. Statusen visar 'ready' när data är tillgänglig, 'error' vid fel, eller 'pending' före första anropet. Perfekt för dashboard-integrationer som ApexCharts som behöver läsa prisdata från entitetsattribut.",
            "usage_tips": "Konfigurera YAML-parametrarna i integrationsalternativen för att matcha ditt get_chartdata-tjänstanrop. Sensorn uppdateras automatiskt när prisdata uppdateras (vanligtvis efter midnatt och när morgondagens data anländer). Få tillgång till tjänstesvarsdata direkt från entitetens attribut - strukturen matchar exakt vad get_chartdata returnerar."
        },
        "chart_metadata": {
            "description": "Lättviktig metadata för diagramkonfiguration",
            "long_description": "Tillhandahåller väsentliga diagramkonfigurationsvärden som sensorattribut. Användbart för vilket diagramkort som helst som behöver Y-axelgränser. Sensorn anropar get_chartdata med endast-metadata-läge (ingen databehandling) och extraherar: yaxis_min, yaxis_max (föreslagen Y-axelomfång för optimal skalning). Statusen återspeglar tjänstanropsresultatet: 'ready' vid framgång, 'error' vid fel, 'pending' under initialisering.",
            "usage_tips": "Konfigurera via configuration.yaml under tibber_prices.chart_metadata_config (valfritt: day, minor_currency, resolution). Sensorn uppdateras automatiskt vid pris dataändringar. Få tillgång till metadata från attribut: yaxis_min, yaxis_max. Använd med config-template-card eller vilket verktyg som helst som läser entitetsattribut - perfekt för dynamisk diagramkonfiguration utan manuella beräkningar."
        }
    },
    "binary_sensor": {
        "tomorrow_data_available": {
            "description": "Om prisdata för morgondagen är tillgänglig",
            "long_description": "Indikerar om prisdata för följande dag har mottagits från Tibber",
            "usage_tips": "Använd detta för att kontrollera om morgondagens priser är tillgängliga för planering"
        },
        "peak_price_period": {
            "description": "Om nuvarande intervall är bland de dyraste på dagen",
            "long_description": "Aktiveras när nuvarande pris ligger i topp 20% av dagens priser",
            "usage_tips": "Använd detta för att undvika att köra högkonsumtionsapparater under dyra intervaller"
        },
        "best_price_period": {
            "description": "Om nuvarande intervall är bland de billigaste på dagen",
            "long_description": "Aktiveras när nuvarande pris ligger i botten 20% av dagens priser",
            "usage_tips": "Använd detta för att köra högkonsumtionsapparater under de billigaste intervallerna"
        },
        "connection": {
            "description": "Om anslutningen till Tibber API fungerar",
            "long_description": "Indikerar om integrationen framgångsrikt kan ansluta till Tibber API",
            "usage_tips": "Använd detta för att övervaka anslutningsstatus till Tibber API"
        },
        "has_ventilation_system": {
            "description": "Om din bostad har ventilationssystem",
            "long_description": "Indikerar om ett ventilationssystem är registrerat för din bostad i Tibber-kontot. Ventilationssystem kan vara betydande elförbrukare som kan dra nytta av smart schemaläggning.",
            "usage_tips": "Använd detta för att aktivera ventilationsspecifika automationer eller energiövervakning. Om aktivt, överväg att schemalägga ventilation under lågprisperioder."
        },
        "realtime_consumption_enabled": {
            "description": "Om realtidsförbrukningsövervakning är aktiv",
            "long_description": "Indikerar om realtidsövervakning av elförbrukning är aktiverad och aktiv för ditt Tibber-hem. Detta kräver kompatibel mätutrustning (t.ex. Tibber Pulse) och en aktiv prenumeration.",
            "usage_tips": "Använd detta för att verifiera att realtidsförbrukningen är tillgänglig. Aktivera meddelanden om detta oväntat ändras till 'av', vilket indikerar potentiella hårdvaru- eller anslutningsproblem."
        },
        "chart_data_export": {
            "description": "Dataexport för instrumentpanelsintegrationer",
            "long_description": "Denna binär sensor anropar tjänsten get_chartdata för att exportera prissensordata i format som är kompatibelt med ApexCharts och andra instrumentpanelskomponenter. Använd denna tillsammans med custom:apexcharts-card för att visa prissensorer på din instrumentpanel.",
            "usage_tips": "Konfigurera YAML-parametrarna i integrationens alternativ under 'ApexCharts-datakonfiguration'. Tjänsten kräver en giltig sensorenhet och returnerar formaterad data för kartrendring. Se dokumentationen för tillgängliga parametrar och anpassningsalternativ."
        }
    },
    "home_types": {
        "APARTMENT": "Lägenhet",
        "ROWHOUSE": "Radhus",
        "HOUSE": "Hus",
        "COTTAGE": "Stuga"
    },
    "time_units": {
        "day": "{count} dag",
        "days": "{count} dagar",
        "hour": "{count} timme",
        "hours": "{count} timmar",
        "minute": "{count} minut",
        "minutes": "{count} minuter",
        "ago": "{parts} sedan",
        "now": "nu"
    },
    "attribution": "Data tillhandahålls av Tibber"
}
